{
    "Dog Breeds": [
        {
            "name": "Affenpinscher",
            "average_weight_kg": [3.2, 4.5],
            "average_height_cm": [23, 30],
            "dietary_recommendations": "Affenpinschers should be fed a high-quality dog food, either commercially made or home-prepared with veterinary supervision. The diet should be suitable for the dog's age (puppy, adult, or senior). Monitor calorie intake to prevent obesity, and limit treats. Ensure access to fresh, clean water at all times.",
            "age_related_recommendations": {
              "puppy": "Provide a puppy formula with balanced nutrients for growth.",
              "adult": "Maintain a balanced diet with controlled calorie intake to avoid weight gain.",
              "senior": "Consider a low-calorie senior diet to prevent obesity."
            },
            "special_considerations": "Prone to obesity; monitor calorie consumption.",
            "activity_level": "medium",
            "exercise_recommendations": "Short walks or indoor play are suitable. Limit jumping or rough play to prevent injury.",
            "age_related_exercise": {
              "puppy": "Frequent short play sessions indoors.",
              "adult": "Daily walks of 20-30 minutes, supplemented with playtime.",
              "senior": "Shorter, gentler walks; focus on low-impact activities."
            },
            "special_health_considerations": "Monitor for breathing issues in hot weather; avoid strenuous exercise."
          }, 
          
        
          {
            "name": "Afghan Hound",
            "average_weight_kg": [
                22.7,
                27.2
            ],
            "average_height_cm": [
                63.5,
                68.6
            ],
            "dietary_recommendations": "Afghan Hounds should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). Monitor their weight to avoid obesity, as they have a slender build. Avoid overfeeding treats, and ensure fresh, clean water is available at all times.",
            "age_related_recommendations": {
                "puppy": "Feed a puppy formula that supports healthy bone growth and development.",
                "adult": "Maintain a balanced diet with adequate protein for their lean muscle mass.",
                "senior": "Consider a senior dog diet to support joint health and maintain a healthy weight."
            },
            "special_considerations": "Afghan Hounds have a unique metabolism and slender build, requiring careful monitoring of their diet.",
            "activity_level": "High",
            "exercise_recommendations": "Daily exercise is essential for Afghan Hounds, including long walks or runs in a safe, enclosed area. They thrive in activities that allow them to run freely.",
            "age_related_exercise": {
                "puppy": "Short play sessions and gentle walks to avoid stress on developing joints.",
                "adult": "Regular, vigorous exercise such as running or long walks to keep them fit.",
                "senior": "Shorter, more frequent walks; avoid strenuous activity to protect joints."
            },
            "special_health_considerations": "Afghan Hounds may have sensitive joints; ensure exercise routines are appropriate for their age and physical condition."
        },

        {
            "name": "African Hunting Dog",
            "average_weight_kg": [
                18, 
                36
            ],
            "average_height_cm": [
                61, 
                76
            ],
            "dietary_recommendations": "In the wild, African Hunting Dogs are carnivorous and primarily eat large prey such as antelope, warthogs, and small mammals. In captivity, a high-protein diet with raw meat is often provided, but consultation with a wildlife nutritionist is essential for proper care.",
            "age_related_recommendations": {
                "puppy": "Puppies require a diet that supports rapid growth, often including high-protein food and supplements to mimic their natural diet.",
                "adult": "Maintain a diet high in protein with appropriate levels of fat for energy. Frequent feeding may be necessary to meet their high metabolic demands.",
                "senior": "Monitor weight and adjust the diet to avoid obesity. Include joint support supplements to help maintain mobility."
            },
            "special_considerations": "As a wild species, their dietary needs differ significantly from domesticated dogs. Their natural diet consists entirely of raw meat, and they require specific nutrients found in wild prey.",
            "activity_level": "Very High",
            "exercise_recommendations": "African Hunting Dogs are extremely active and require large spaces to roam and hunt. In captivity, providing enrichment activities that mimic hunting behavior, such as tracking and chasing games, is beneficial.",
            "age_related_exercise": {
                "puppy": "Encourage natural play behaviors with siblings or simulated hunts to develop hunting skills.",
                "adult": "Provide plenty of space for running and simulate hunting behaviors through enrichment activities.",
                "senior": "Reduce the intensity of activities but maintain regular exercise to keep joints mobile."
            },
            "special_health_considerations": "In captivity, they may be prone to stress-related illnesses due to limited space. Regular veterinary check-ups are essential to monitor for health issues common in captive wildlife."
        },
        
        {
            "name": "Airedale Terrier",
            "average_weight_kg": [
                22.7,
                31.8
            ],
            "average_height_cm": [
                58.4,
                58.4
            ],
            "dietary_recommendations": "Airedale Terriers should be fed a high-quality dog food that is appropriate for their age (puppy, adult, or senior). Monitor portion sizes to avoid overfeeding, as they are an active breed and can easily gain weight if not properly managed. Fresh water should always be available.",
            "age_related_recommendations": {
                "puppy": "Feed a puppy-specific formula rich in protein to support growth and energy needs.",
                "adult": "Provide a balanced diet with sufficient protein and fat to maintain energy levels and muscle mass.",
                "senior": "Consider a senior formula with joint support supplements to help maintain mobility."
            },
            "special_considerations": "Airedales are active and may require higher caloric intake during intense activity periods. Monitor for any food allergies or sensitivities.",
            "activity_level": "High",
            "exercise_recommendations": "Airedales require daily vigorous exercise, including long walks, runs, or play sessions. They excel in activities that engage both their body and mind, such as agility or obedience training.",
            "age_related_exercise": {
                "puppy": "Short, controlled play sessions with plenty of rest periods.",
                "adult": "Daily activities such as running, hiking, or advanced training exercises to keep them mentally and physically stimulated.",
                "senior": "Gentle walks and low-impact activities to maintain mobility while avoiding joint stress."
            },
            "special_health_considerations": "Airedales may be prone to hip dysplasia and other joint issues, especially as they age, so avoid overexertion and provide joint supplements if needed."
        },

        {
            "name": "Akbash Dog",
            "average_weight_kg": [
                34, 
                64
            ],
            "average_height_cm": [
                71, 
                86
            ],
            "dietary_recommendations": "Akbash Dogs should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). Due to their size, they benefit from a diet that supports joint health, including supplements like glucosamine and chondroitin. Avoid overfeeding to prevent obesity, which can strain their joints.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports slow and steady growth to prevent joint issues.",
                "adult": "Maintain a balanced diet with sufficient protein to support muscle mass, and include joint supplements.",
                "senior": "Switch to a senior diet with lower calories to maintain a healthy weight. Consider adding joint support supplements."
            },
            "special_considerations": "Akbash Dogs are prone to hip dysplasia and other joint issues, so maintaining a healthy weight and including joint support in their diet is important.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Akbash Dogs require daily exercise, such as long walks or secure, off-leash play in a fenced area. They are natural guardians and may also benefit from tasks or activities that engage their instincts.",
            "age_related_exercise": {
                "puppy": "Encourage gentle play and short walks. Avoid excessive jumping or intense exercise to protect developing joints.",
                "adult": "Daily walks and off-leash exercise in a secure area are ideal. They also enjoy tasks that engage their guarding instincts.",
                "senior": "Gentle walks to maintain mobility. Avoid high-impact activities that could strain joints."
            },
            "special_health_considerations": "Monitor for joint issues such as hip dysplasia. Regular veterinary check-ups can help identify and manage any emerging health concerns."
        },

        {
            "name": "Akita",
            "average_weight_kg": [
                31.8,
                59
            ],
            "average_height_cm": [
                61,
                71
            ],
            "dietary_recommendations": "Akitas should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). Since they are a large breed, it is important to avoid overfeeding to maintain a healthy weight and prevent joint strain. A diet that includes joint support supplements, such as glucosamine, can be beneficial.",
            "age_related_recommendations": {
                "puppy": "Feed a large-breed puppy formula that supports healthy growth and development, avoiding excessive calcium to prevent joint issues.",
                "adult": "Maintain a balanced diet with sufficient protein to support muscle mass. Include joint supplements if needed.",
                "senior": "Switch to a senior formula with lower calories to maintain a healthy weight. Joint supplements are recommended to support mobility."
            },
            "special_considerations": "Akitas may be prone to hip dysplasia, autoimmune disorders, and bloat. It is important to avoid vigorous exercise immediately after eating and feed smaller, frequent meals to reduce the risk of bloat.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Akitas require regular exercise, such as daily walks or play sessions. They are known for their loyalty and may enjoy activities that involve their owners, such as obedience training or hiking.",
            "age_related_exercise": {
                "puppy": "Short walks and play sessions to avoid stressing growing joints.",
                "adult": "Daily exercise, including walks and structured activities, is essential to keep them fit and mentally stimulated.",
                "senior": "Gentle, consistent exercise to maintain mobility. Avoid high-impact activities to protect aging joints."
            },
            "special_health_considerations": "Monitor for signs of hip dysplasia, autoimmune conditions, and bloat. Regular veterinary check-ups are recommended to catch any issues early."
        },

        {
            "name": "Alapaha Blue Blood Bulldog",
            "average_weight_kg": [
                25,
                45
            ],
            "average_height_cm": [
                50,
                66
            ],
            "dietary_recommendations": "Alapaha Blue Blood Bulldogs should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). Due to their muscular build, they may benefit from a diet with sufficient protein to maintain muscle mass. Monitor portion sizes to prevent obesity, as they can be prone to weight gain.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula rich in protein and fat to support healthy growth and development.",
                "adult": "Maintain a balanced diet with enough protein to support muscle mass and monitor calorie intake to avoid excessive weight gain.",
                "senior": "Switch to a senior formula that supports joint health and helps maintain a healthy weight."
            },
            "special_considerations": "This breed can be prone to hip dysplasia and other joint issues, so maintaining a healthy weight and providing joint supplements if needed is important.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Alapaha Blue Blood Bulldogs need regular exercise, such as daily walks or playtime in a fenced yard. They also enjoy activities that involve interaction with their owners, like obedience training or playing fetch.",
            "age_related_exercise": {
                "puppy": "Short, controlled play sessions and gentle walks to avoid stressing growing joints.",
                "adult": "Daily exercise such as long walks, playtime, or light running to maintain fitness.",
                "senior": "Gentle walks and low-impact activities to keep joints mobile while avoiding high-impact exercises."
            },
            "special_health_considerations": "Monitor for signs of joint problems like hip dysplasia. Regular check-ups and maintaining an appropriate weight can help manage potential health issues."
        },
        
        {
            "name": "Alaskan Husky",
            "average_weight_kg": [
                18,
                27
            ],
            "average_height_cm": [
                50,
                60
            ],
            "dietary_recommendations": "Alaskan Huskies should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). Given their high energy levels, they may benefit from a diet rich in protein and fat to sustain their activity levels. Avoid overfeeding to prevent weight gain, and ensure access to fresh, clean water at all times.",
            "age_related_recommendations": {
                "puppy": "Provide a high-calorie puppy formula to support their rapid growth and high energy requirements.",
                "adult": "Maintain a balanced diet with high protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula with joint support to help maintain mobility, but continue providing sufficient calories to meet energy needs."
            },
            "special_considerations": "Alaskan Huskies are prone to joint issues, especially in older age, and may require joint supplements. Due to their working dog nature, they need a diet that matches their activity level, particularly during the winter months when they may be more active.",
            "activity_level": "Very High",
            "exercise_recommendations": "Alaskan Huskies require daily vigorous exercise, such as running, hiking, or sledding. They are bred for endurance and enjoy activities that challenge their stamina and mental capabilities.",
            "age_related_exercise": {
                "puppy": "Frequent, short play sessions to build stamina, but avoid intense activity to protect growing joints.",
                "adult": "Daily high-intensity activities like running, pulling, or long hikes to keep them fit and mentally stimulated.",
                "senior": "Shorter but regular walks to maintain mobility. Avoid overly strenuous activities to protect aging joints."
            },
            "special_health_considerations": "Monitor for signs of joint problems, especially as they age. Keep them active to prevent boredom, but avoid overexertion in hot weather as they can be prone to overheating."
        },
        
        {
            "name": "Alaskan Malamute",
            "average_weight_kg": [
                34,
                45
            ],
            "average_height_cm": [
                58,
                64
            ],
            "dietary_recommendations": "Alaskan Malamutes should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). Due to their large size and energy levels, a diet rich in protein can help maintain muscle mass. Avoid overfeeding to prevent obesity, which can put strain on their joints.",
            "age_related_recommendations": {
                "puppy": "Feed a large-breed puppy formula to support steady growth without putting stress on developing joints.",
                "adult": "Maintain a balanced diet with sufficient protein and healthy fats to sustain energy levels and muscle mass.",
                "senior": "Switch to a senior formula with joint support to help maintain mobility, and monitor weight to prevent extra stress on joints."
            },
            "special_considerations": "Alaskan Malamutes are prone to hip dysplasia, so maintaining a healthy weight and including joint supplements can be beneficial. They may also require more food during colder months if they are more active.",
            "activity_level": "High",
            "exercise_recommendations": "Alaskan Malamutes need regular, vigorous exercise, such as long walks, hikes, or pulling activities like carting or sledding. They enjoy tasks that challenge their strength and endurance.",
            "age_related_exercise": {
                "puppy": "Short, controlled play sessions and gentle walks. Avoid intense activities to protect growing joints.",
                "adult": "Daily high-intensity exercises, such as running, hiking, or pulling, to keep them fit.",
                "senior": "Gentle walks and low-impact activities to maintain mobility while avoiding strenuous exercise."
            },
            "special_health_considerations": "Monitor for hip dysplasia and other joint issues. Regular check-ups and appropriate exercise are key to managing potential health problems."
        },

        {
            "name": "American Bulldog",
            "average_weight_kg": [
                27,
                54
            ],
            "average_height_cm": [
                51,
                71
            ],
            "dietary_recommendations": "American Bulldogs should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). Due to their muscular build, a diet rich in protein can help maintain muscle mass. Monitor portion sizes to avoid overfeeding, as they can be prone to obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth, with balanced calcium and phosphorus levels for bone development.",
                "adult": "Maintain a diet high in protein and moderate in fat to sustain their muscle mass and energy needs.",
                "senior": "Switch to a senior dog formula that supports joint health, and consider adding supplements like glucosamine and chondroitin."
            },
            "special_considerations": "American Bulldogs may be prone to hip dysplasia and other joint issues, so maintaining a healthy weight and including joint supplements is important.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "American Bulldogs require daily exercise, such as walks, play sessions, or structured activities like obedience training. They enjoy tasks that engage both their strength and stamina.",
            "age_related_exercise": {
                "puppy": "Short, controlled play sessions and walks to avoid stress on growing joints.",
                "adult": "Regular, vigorous exercise, such as long walks, hikes, or structured play to keep them fit.",
                "senior": "Gentle walks and low-impact activities to maintain mobility while protecting aging joints."
            },
            "special_health_considerations": "Monitor for hip dysplasia and other joint issues, as well as potential breathing difficulties in hot weather. Regular vet check-ups are recommended to detect any emerging health concerns early."
        },
        

        {
            "name": "American Bully",
            "average_weight_kg": [
                27,
                50
            ],
            "average_height_cm": [
                33,
                53
            ],
            "dietary_recommendations": "American Bullies should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). Due to their muscular build, a diet rich in protein and fat can help maintain muscle mass and support energy levels. Monitor portion sizes to prevent obesity, as they can be prone to weight gain.",
            "age_related_recommendations": {
                "puppy": "Feed a large-breed puppy formula that supports healthy growth without excessive calcium to avoid joint issues.",
                "adult": "Maintain a balanced diet with adequate protein to sustain their muscular frame and avoid overfeeding.",
                "senior": "Switch to a senior formula that helps maintain a healthy weight and supports joint health."
            },
            "special_considerations": "American Bullies may be prone to certain health issues like hip dysplasia, so maintaining a healthy weight and providing joint support supplements is beneficial.",
            "activity_level": "Moderate",
            "exercise_recommendations": "American Bullies require regular exercise, including daily walks, play sessions, and mental stimulation through training. Engaging in activities that challenge their strength and intelligence is important.",
            "age_related_exercise": {
                "puppy": "Short, controlled play sessions and gentle walks to avoid stress on growing joints.",
                "adult": "Regular exercise, including walks and structured activities, to keep them fit and mentally stimulated.",
                "senior": "Gentle walks and low-impact activities to maintain mobility while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for joint issues, especially as they age. Regular vet check-ups can help manage potential health problems, and proper nutrition is essential to avoid obesity."
        },        
        
        {
            "name": "American Eskimo Dog",
            "average_weight_kg": [
                2.7,
                16
            ],
            "average_height_cm": [
                23,
                48
            ],
            "dietary_recommendations": "American Eskimo Dogs should be fed a high-quality dog food that is appropriate for their age (puppy, adult, or senior). This breed is prone to obesity, so it's important to monitor their weight and calorie intake. Feeding schedules with controlled portion sizes are recommended over free feeding.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports growth and development, with balanced nutrients for a healthy coat.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support an active lifestyle.",
                "senior": "Switch to a senior formula with lower calories to prevent weight gain, and include supplements to support joint health."
            },
            "special_considerations": "American Eskimo Dogs may be prone to obesity, so monitoring food intake and regular exercise is important. Their dense coat may also require specific nutrients for optimal skin and coat health.",
            "activity_level": "Moderate",
            "exercise_recommendations": "American Eskimo Dogs require daily exercise, such as walks, play sessions, or training activities. They enjoy tasks that involve learning new tricks or agility exercises.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to build stamina and coordination.",
                "adult": "Regular exercise, including long walks, agility training, or playtime to keep them mentally and physically fit.",
                "senior": "Gentle walks and low-impact activities to maintain mobility and prevent weight gain."
            },
            "special_health_considerations": "Monitor for joint issues and obesity as they age. Regular grooming is necessary to maintain their coat, and a diet that supports skin and coat health is beneficial."
        },
        {
            "name": "American Eskimo Dog (Miniature)",
            "average_weight_kg": [
                4.5,
                11.3
            ],
            "average_height_cm": [
                30,
                38
            ],
            "dietary_recommendations": "American Eskimo Dogs (Miniature) should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). This breed is prone to obesity, so it's important to monitor their weight and calorie intake. Controlled portion sizes and feeding schedules are recommended over free feeding.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports growth and development, with balanced nutrients for a healthy coat.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support an active lifestyle.",
                "senior": "Switch to a senior formula with lower calories to prevent weight gain, and include supplements to support joint health."
            },
            "special_considerations": "Miniature American Eskimo Dogs may be prone to obesity, so monitoring food intake and regular exercise is important. Their dense coat may also require specific nutrients for optimal skin and coat health.",
            "activity_level": "Moderate",
            "exercise_recommendations": "American Eskimo Dogs (Miniature) require daily exercise, such as walks, play sessions, or training activities. They enjoy tasks that involve learning new tricks or agility exercises.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to build stamina and coordination.",
                "adult": "Regular exercise, including long walks, agility training, or playtime to keep them mentally and physically fit.",
                "senior": "Gentle walks and low-impact activities to maintain mobility and prevent weight gain."
            },
            "special_health_considerations": "Monitor for joint issues and obesity as they age. Regular grooming is necessary to maintain their coat, and a diet that supports skin and coat health is beneficial."
        },        
        {
            "name": "American Foxhound",
            "average_weight_kg": [
                25,
                32
            ],
            "average_height_cm": [
                56,
                64
            ],
            "dietary_recommendations": "American Foxhounds should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). Due to their active nature, a diet rich in protein and fat can help maintain energy levels and muscle mass. Monitor food portions to prevent obesity, especially if they are not regularly exercised.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development, ensuring a balanced intake of nutrients.",
                "adult": "Maintain a balanced diet that includes adequate protein to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health as they age."
            },
            "special_considerations": "American Foxhounds are known for their endurance and can be prone to obesity if not exercised regularly. It's important to monitor their weight and adjust their diet as necessary.",
            "activity_level": "High",
            "exercise_recommendations": "American Foxhounds require regular, vigorous exercise, such as daily runs, long walks, or play sessions. They thrive in activities that engage their hunting instincts, such as scent work or tracking.",
            "age_related_exercise": {
                "puppy": "Short, controlled play sessions and walks to build stamina without overexertion.",
                "adult": "Daily vigorous exercise, including running, hiking, or engaging in scent work to keep them physically and mentally stimulated.",
                "senior": "Regular walks and low-impact activities to maintain mobility while avoiding strenuous exercise."
            },
            "special_health_considerations": "Monitor for signs of joint issues, especially as they age. Regular exercise is crucial to prevent obesity and maintain overall health."
        },
        {
            "name": "American Pit Bull Terrier",
            "average_weight_kg": [
                14,
                36
            ],
            "average_height_cm": [
                43,
                53
            ],
            "dietary_recommendations": "American Pit Bull Terriers should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining muscle mass and supporting their active lifestyle. Monitoring portions is important to avoid obesity, which can lead to various health issues.",
            "age_related_recommendations": {
                "puppy": "Feed a high-quality puppy formula that supports growth and development, with balanced nutrients.",
                "adult": "Maintain a diet high in protein and fat to support their energetic lifestyle, adjusting portions based on activity level.",
                "senior": "Switch to a senior formula that supports joint health and maintains a healthy weight."
            },
            "special_considerations": "American Pit Bull Terriers may be prone to skin allergies, hip dysplasia, and obesity. Regular check-ups and a well-balanced diet are essential for their health.",
            "activity_level": "High",
            "exercise_recommendations": "American Pit Bull Terriers require regular exercise, such as daily walks, play sessions, and engaging activities like agility or obedience training to keep them mentally and physically stimulated.",
            "age_related_exercise": {
                "puppy": "Short play sessions and gentle walks to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including long walks, running, and interactive play to maintain fitness and mental health.",
                "senior": "Regular, moderate exercise to maintain mobility, avoiding high-impact activities to protect joints."
            },
            "special_health_considerations": "Monitor for signs of skin allergies and joint issues, especially as they age. Regular veterinary care is important to address any emerging health concerns early."
        },
        
    
        {
            "name": "American Staffordshire Terrier",
            "average_weight_kg": [
                22,
                36
            ],
            "average_height_cm": [
                43,
                48
            ],
            "dietary_recommendations": "American Staffordshire Terriers should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein is crucial for maintaining muscle mass and supporting their active lifestyle. Portion control is important to avoid obesity, which can lead to health problems.",
            "age_related_recommendations": {
                "puppy": "Feed a high-quality puppy formula that supports healthy growth and development, ensuring balanced nutrients.",
                "adult": "Maintain a diet high in protein and moderate in fat to sustain their muscle mass and energy levels.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "American Staffordshire Terriers are strong and muscular dogs, so it’s essential to provide a diet that meets their energy needs while preventing obesity.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "American Staffordshire Terriers require regular exercise, including daily walks, playtime, and engaging activities like agility training or obedience exercises to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short play sessions and gentle walks to build stamina and coordination.",
                "adult": "Regular exercise such as running, hiking, and interactive play to maintain their fitness.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues, especially as they age. Regular veterinary check-ups are essential to manage potential health concerns effectively."
        },
        
        {
            "name": "American Water Spaniel",
            "average_weight_kg": [
                11,
                27
            ],
            "average_height_cm": [
                36,
                46
            ],
            "dietary_recommendations": "American Water Spaniels should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein and fat is essential for maintaining energy levels, especially for active dogs. Monitor portion sizes to prevent obesity, which can lead to various health issues.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development with balanced nutrients.",
                "adult": "Maintain a diet high in protein to support their active lifestyle, adjusting portions based on their activity level.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "American Water Spaniels are known for their versatility in hunting and retrieving, so it's essential to provide a diet that meets their energy requirements. They may also be prone to skin allergies.",
            "activity_level": "High",
            "exercise_recommendations": "American Water Spaniels require regular exercise, including daily walks, playtime, and activities that engage their retrieving instincts, such as swimming or fetching.",
            "age_related_exercise": {
                "puppy": "Short play sessions and gentle walks to build stamina and coordination.",
                "adult": "Daily vigorous exercise, including swimming and retrieving games to maintain fitness.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of skin allergies and joint issues, especially as they age. Regular veterinary check-ups are important to address any emerging health concerns early."
        },
        
        {
            "name": "Anatolian Shepherd Dog",
            "average_weight_kg": [
                36,
                68
            ],
            "average_height_cm": [
                66,
                81
            ],
            "dietary_recommendations": "Anatolian Shepherd Dogs should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). Due to their large size, a diet rich in protein and fat is important for maintaining muscle mass and supporting their active lifestyle. Monitor portions to prevent obesity, which can lead to joint issues.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium to avoid joint issues.",
                "adult": "Maintain a balanced diet high in protein and fat to support their energy levels and muscle mass.",
                "senior": "Switch to a senior formula with joint support to help maintain mobility as they age."
            },
            "special_considerations": "Anatolian Shepherds are prone to hip dysplasia and other joint problems, so maintaining a healthy weight and including joint supplements is beneficial.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "Anatolian Shepherd Dogs require regular exercise, including daily walks, play sessions, and engaging activities that stimulate their instincts, such as guarding exercises.",
            "age_related_exercise": {
                "puppy": "Short, controlled play sessions to avoid stressing developing joints.",
                "adult": "Regular, moderate to vigorous exercise, including walks and playtime to keep them fit and mentally stimulated.",
                "senior": "Gentle walks and low-impact activities to maintain mobility while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues, especially as they age. Regular veterinary check-ups are important to catch any health concerns early."
        },
        
        {
            "name": "Appenzeller Sennenhund",
            "average_weight_kg": [
                20,
                32
            ],
            "average_height_cm": [
                46,
                58
            ],
            "dietary_recommendations": "Appenzeller Sennenhunds should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein and fat is essential to support their active lifestyle and maintain muscle mass. Portion control is important to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development with balanced nutrients.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to sustain their energy levels.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Appenzeller Sennenhunds may be prone to certain health issues like hip dysplasia, so monitoring weight and providing joint support supplements is beneficial.",
            "activity_level": "High",
            "exercise_recommendations": "Appenzeller Sennenhunds require regular exercise, including daily walks, play sessions, and engaging activities that challenge their physical and mental abilities, such as herding tasks or agility training.",
            "age_related_exercise": {
                "puppy": "Short, controlled play sessions to build stamina and coordination without overexerting.",
                "adult": "Daily vigorous exercise, including long walks and active play to keep them physically fit and mentally stimulated.",
                "senior": "Gentle walks and low-impact activities to maintain mobility while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues, especially as they age. Regular vet check-ups can help manage potential health problems early."
        },
        
        {
            "name": "Australian Cattle Dog",
            "average_weight_kg": [
                16,
                27
            ],
            "average_height_cm": [
                43,
                51
            ],
            "dietary_recommendations": "Australian Cattle Dogs should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and muscle mass, especially since they are highly active working dogs. Monitor portion sizes to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a high-quality puppy formula that supports healthy growth and development, with appropriate levels of calcium and phosphorus.",
                "adult": "Maintain a balanced diet with sufficient protein to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health, and consider joint supplements as needed."
            },
            "special_considerations": "Australian Cattle Dogs are prone to hip dysplasia and other joint issues, so maintaining a healthy weight and providing joint support is important.",
            "activity_level": "Very High",
            "exercise_recommendations": "Australian Cattle Dogs require regular, vigorous exercise, including daily walks, runs, and engaging activities that stimulate their herding instincts, such as agility training or fetch.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination without overexerting.",
                "adult": "Daily vigorous exercise, including running and interactive play to keep them fit and mentally stimulated.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility without excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues, especially as they age. Regular veterinary check-ups are important to catch any health concerns early."
        },
        
        {
            "name": "Australian Kelpie",
            "average_weight_kg": [
                13,
                20
            ],
            "average_height_cm": [
                41,
                51
            ],
            "dietary_recommendations": "Australian Kelpies should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein and fat is essential for maintaining their energy levels and muscle mass, particularly because they are active working dogs. Monitor portion sizes to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a high-quality puppy formula that supports healthy growth and development, ensuring a balance of nutrients.",
                "adult": "Maintain a balanced diet with sufficient protein to support their active lifestyle and work requirements.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health, with supplements as needed."
            },
            "special_considerations": "Australian Kelpies are prone to certain health issues such as hip dysplasia, so maintaining a healthy weight and providing joint support is important.",
            "activity_level": "Very High",
            "exercise_recommendations": "Australian Kelpies require regular, vigorous exercise, including daily walks, runs, and engaging activities that stimulate their herding instincts, such as agility training or herding exercises.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination without overexertion.",
                "adult": "Daily vigorous exercise, including running and interactive play to keep them fit and mentally stimulated.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility without excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues, especially as they age. Regular veterinary check-ups are crucial to catch any health concerns early."
        },
        
        {
            "name": "Australian Shepherd",
            "average_weight_kg": [
                16,
                32
            ],
            "average_height_cm": [
                46,
                61
            ],
            "dietary_recommendations": "Australian Shepherds should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein and fat is essential to support their high energy levels and maintain muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development, ensuring balanced nutrients.",
                "adult": "Maintain a balanced diet with sufficient protein to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Australian Shepherds are prone to hip dysplasia and other joint issues, so it's important to maintain a healthy weight and provide joint support supplements.",
            "activity_level": "Very High",
            "exercise_recommendations": "Australian Shepherds require regular, vigorous exercise, including daily walks, runs, and engaging activities that stimulate their herding instincts.",
            "age_related_exercise": {
                "puppy": "Short, controlled play sessions to build stamina and coordination without overexertion.",
                "adult": "Daily vigorous exercise, including running, hiking, and agility training to keep them fit and mentally stimulated.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and eye problems as they age. Regular veterinary check-ups are essential."
        },
        
        {
            "name": "Australian Terrier",
            "average_weight_kg": [
                5.5,
                6.5
            ],
            "average_height_cm": [
                23,
                28
            ],
            "dietary_recommendations": "Australian Terriers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports growth and development with balanced nutrients.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "This breed can be prone to skin allergies and requires a diet that supports skin health.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Australian Terriers require regular exercise, such as daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play to maintain fitness.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and skin allergies. Regular vet check-ups are important."
        },
        
        {
            "name": "Azawakh",
            "average_weight_kg": [
                15,
                25
            ],
            "average_height_cm": [
                61,
                74
            ],
            "dietary_recommendations": "Azawakh should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein and fat is important for maintaining their energy levels and muscle mass due to their active lifestyle.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development with balanced nutrients.",
                "adult": "Maintain a balanced diet that includes high protein to sustain their energy needs.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Azawakh dogs can be prone to certain health issues, including hip dysplasia, so it's important to maintain a healthy weight and provide joint support supplements.",
            "activity_level": "High",
            "exercise_recommendations": "Azawakh require regular, vigorous exercise, including daily runs, walks, and activities that engage their natural instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and physical development.",
                "adult": "Daily vigorous exercise, such as running and playing to keep them physically fit and mentally stimulated.",
                "senior": "Moderate exercise, including gentle walks to maintain mobility without overexertion."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to catch any health concerns early."
        },
        
        {
            "name": "Barbet",
            "average_weight_kg": [
                14,
                29
            ],
            "average_height_cm": [
                51,
                62
            ],
            "dietary_recommendations": "Barbets should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein is essential to support their active lifestyle and maintain healthy skin and coat.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports growth and development with balanced nutrients.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to sustain energy levels.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Barbets may be prone to skin issues, so a diet that supports skin health is beneficial.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "Barbets require regular exercise, including daily walks, playtime, and water activities that engage their natural retrieving instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate to vigorous exercise, including swimming and retrieving activities.",
                "senior": "Gentle walks and low-impact activities to maintain mobility without excessive strain."
            },
            "special_health_considerations": "Monitor for signs of skin issues and provide regular veterinary care to address any emerging health concerns early."
        },
        
        {
            "name": "Basenji",
            "average_weight_kg": [
                9,
                11
            ],
            "average_height_cm": [
                40,
                43
            ],
            "dietary_recommendations": "Basenjis should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and muscle mass, but they should be monitored for weight gain due to their propensity for obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet with sufficient protein to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Basenjis can be sensitive to certain ingredients, so it's important to monitor their diet and adjust accordingly if allergies arise.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "Basenjis require regular exercise, including daily walks and play sessions to keep them physically and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including runs and interactive play to maintain fitness.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and digestive sensitivities. Regular vet check-ups are essential to address any health concerns early."
        },
        
        {
            "name": "Basset Fauve de Bretagne",
            "average_weight_kg": [
                14,
                18
            ],
            "average_height_cm": [
                33,
                38
            ],
            "dietary_recommendations": "Basset Fauve de Bretagne should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein and fat is important for maintaining their energy levels, particularly due to their active nature.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet with sufficient protein to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "This breed may be prone to obesity, so portion control and regular exercise are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Basset Fauve de Bretagne requires regular exercise, including daily walks and playtime to keep them physically and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and ensure regular veterinary check-ups to manage potential health concerns."
        },
        
        {
            "name": "Basset Hound",
            "average_weight_kg": [
                20,
                29
            ],
            "average_height_cm": [
                33,
                38
            ],
            "dietary_recommendations": "Basset Hounds should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). Given their tendency to gain weight, it's crucial to monitor portions and provide a balanced diet to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development, ensuring balanced nutrients.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Basset Hounds can be prone to obesity and certain health issues, such as hip dysplasia, so regular monitoring and weight management are essential.",
            "activity_level": "Low to Moderate",
            "exercise_recommendations": "Basset Hounds require regular, moderate exercise, including daily walks and playtime to keep them fit without overexerting them.",
            "age_related_exercise": {
                "puppy": "Short, controlled play sessions to build stamina without overexertion.",
                "adult": "Daily moderate exercise, including walks and gentle play.",
                "senior": "Gentle walks and low-impact activities to maintain mobility without excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and maintain regular veterinary check-ups to manage any emerging health concerns."
        },
        
        {
            "name": "Beagle",
            "average_weight_kg": [
                9,
                11
            ],
            "average_height_cm": [
                33,
                41
            ],
            "dietary_recommendations": "Beagles should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein helps maintain energy levels and muscle mass. Monitor portions to prevent obesity, as Beagles are prone to weight gain.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Beagles can be prone to obesity, so portion control and regular exercise are essential.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "Beagles require regular exercise, including daily walks, play sessions, and activities that stimulate their hunting instincts, such as scent tracking.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate to vigorous exercise, including running and interactive play.",
                "senior": "Gentle walks and low-impact activities to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and obesity. Regular vet check-ups are important."
        },
        
        {
            "name": "Bearded Collie",
            "average_weight_kg": [
                18,
                27
            ],
            "average_height_cm": [
                46,
                56
            ],
            "dietary_recommendations": "Bearded Collies should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining energy levels and healthy skin and coat.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Bearded Collies may be prone to certain health issues, including hip dysplasia, so maintaining a healthy weight and providing joint support is important.",
            "activity_level": "High",
            "exercise_recommendations": "Bearded Collies require regular, vigorous exercise, including daily walks, play sessions, and activities that engage their herding instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running, agility training, and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility without overexertion."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any emerging health concerns."
        },
        
        {
            "name": "Beauceron",
            "average_weight_kg": [
                27,
                45
            ],
            "average_height_cm": [
                61,
                69
            ],
            "dietary_recommendations": "Beaucerons should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein and fat is essential to support their active lifestyle and maintain muscle mass.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium to avoid joint issues.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to sustain their energy levels.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Beaucerons are prone to hip dysplasia, so maintaining a healthy weight and providing joint support supplements is beneficial.",
            "activity_level": "High",
            "exercise_recommendations": "Beaucerons require regular, vigorous exercise, including daily runs, walks, and engaging activities that challenge their physical and mental abilities.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to build stamina and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility without excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to catch any health concerns early."
        },
        
        {
            "name": "Bedlington Terrier",
            "average_weight_kg": [
                8,
                10
            ],
            "average_height_cm": [
                38,
                44
            ],
            "dietary_recommendations": "Bedlington Terriers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet with sufficient protein and moderate fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Bedlington Terriers can be prone to certain health issues, including liver problems, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Bedlington Terriers require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active without excessive strain."
            },
            "special_health_considerations": "Monitor for signs of liver issues and provide regular veterinary check-ups to manage any health concerns."
        },
        
        {
            "name": "Belgian Malinois",
            "average_weight_kg": [
                27,
                36
            ],
            "average_height_cm": [
                60,
                66
            ],
            "dietary_recommendations": "Belgian Malinois should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and muscle mass, particularly because they are active working dogs.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development with balanced nutrients.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Belgian Malinois may be prone to hip dysplasia, so maintaining a healthy weight and providing joint support is important.",
            "activity_level": "Very High",
            "exercise_recommendations": "Belgian Malinois require regular, vigorous exercise, including daily runs, agility training, and engaging activities that stimulate their intelligence.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to build stamina and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play to keep them physically and mentally stimulated.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility without overexertion."
            },
            "special_health_considerations": "Monitor for signs of joint issues, especially as they age. Regular veterinary check-ups are essential."
        },
        
      
        {
            "name": "Belgian Tervuren",
            "average_weight_kg": [
                25,
                30
            ],
            "average_height_cm": [
                56,
                66
            ],
            "dietary_recommendations": "Belgian Tervurens should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein is crucial for maintaining energy levels and muscle mass, especially for this active working breed.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development, ensuring balanced nutrients.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Belgian Tervurens may be prone to hip dysplasia, so maintaining a healthy weight and providing joint support supplements is beneficial.",
            "activity_level": "Very High",
            "exercise_recommendations": "Belgian Tervurens require regular, vigorous exercise, including daily runs, agility training, and engaging activities that stimulate their intelligence and working instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play to keep them physically and mentally stimulated.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility without overexertion."
            },
            "special_health_considerations": "Monitor for signs of joint issues, especially as they age. Regular veterinary check-ups are essential to detect any health concerns early."
        },
        {
            "name": "Bernese Mountain Dog",
            "average_weight_kg": [
                36,
                50
            ],
            "average_height_cm": [
                58,
                70
            ],
            "dietary_recommendations": "Bernese Mountain Dogs should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein and fat is important for maintaining their energy levels and muscle mass. Portion control is essential to prevent obesity, which is common in this breed.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium to avoid joint issues.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Bernese Mountain Dogs are prone to certain health issues such as hip dysplasia and bloat, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "Bernese Mountain Dogs require regular exercise, including daily walks, playtime, and activities that engage their natural instincts, such as pulling or carting.",
            "age_related_exercise": {
                "puppy": "Short, controlled play sessions to avoid stressing developing joints.",
                "adult": "Daily moderate to vigorous exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and bloat. Regular veterinary check-ups are important to manage potential health concerns."
        },
        
        {
            "name": "Bichon Frise",
            "average_weight_kg": [
                5,
                10
            ],
            "average_height_cm": [
                23,
                30
            ],
            "dietary_recommendations": "Bichon Frises should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity, which they are prone to.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Bichon Frises may be prone to dental issues, so a diet that promotes dental health is beneficial.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Bichon Frises require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of dental issues and provide regular veterinary care to manage any health concerns."
        },
       
        {
            "name": "Black and Tan Coonhound",
            "average_weight_kg": [
                27,
                41
            ],
            "average_height_cm": [
                56,
                69
            ],
            "dietary_recommendations": "Black and Tan Coonhounds should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet with sufficient protein to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "This breed may be prone to obesity, so portion control and regular exercise are important.",
            "activity_level": "High",
            "exercise_recommendations": "Black and Tan Coonhounds require regular exercise, including daily runs, walks, and activities that engage their hunting instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play to keep them fit.",
                "senior": "Gentle walks and low-impact activities to maintain mobility without excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and obesity. Regular vet check-ups are important."
        },
        
        {
            "name": "Bloodhound",
            "average_weight_kg": [
                36,
                50
            ],
            "average_height_cm": [
                58,
                69
            ],
            "dietary_recommendations": "Bloodhounds should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein is essential to support their active lifestyle and maintain muscle mass. Portion control is important to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Bloodhounds are prone to obesity, so monitoring their diet and exercise is crucial.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Bloodhounds require regular exercise, including daily walks, runs, and activities that stimulate their sense of smell.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and maintain regular veterinary check-ups to manage any health concerns."
        },
        
        {
            "name": "Bluetick Coonhound",
            "average_weight_kg": [
                25,
                36
            ],
            "average_height_cm": [
                56,
                69
            ],
            "dietary_recommendations": "Bluetick Coonhounds should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet with sufficient protein to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "This breed can be prone to obesity, so portion control and regular exercise are important.",
            "activity_level": "High",
            "exercise_recommendations": "Bluetick Coonhounds require regular exercise, including daily runs, walks, and activities that engage their hunting instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play to keep them fit.",
                "senior": "Gentle walks and low-impact activities to maintain mobility without excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and obesity. Regular vet check-ups are important."
        },
        
        {
            "name": "Boerboel",
            "average_weight_kg": [
                50,
                90
            ],
            "average_height_cm": [
                60,
                70
            ],
            "dietary_recommendations": "Boerboels should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is important for maintaining their energy levels and muscle mass. Portion control is essential to prevent obesity, which can strain their joints.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Boerboels may be prone to hip dysplasia, so maintaining a healthy weight and providing joint support is important.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "Boerboels require regular exercise, including daily walks, play sessions, and activities that engage their natural instincts.",
            "age_related_exercise": {
                "puppy": "Short, controlled play sessions to avoid stressing developing joints.",
                "adult": "Regular, vigorous exercise, including walking and interactive play to keep them fit.",
                "senior": "Gentle walks and low-impact activities to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any emerging health concerns."
        },
        
        {
            "name": "Border Collie",
            "average_weight_kg": [
                14,
                20
            ],
            "average_height_cm": [
                46,
                56
            ],
            "dietary_recommendations": "Border Collies should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining energy levels and muscle mass, especially due to their active lifestyle.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet with high protein and fat to support their energy levels.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Border Collies can be prone to certain health issues, including hip dysplasia and eye disorders, so regular veterinary care is important.",
            "activity_level": "Very High",
            "exercise_recommendations": "Border Collies require regular, vigorous exercise, including daily runs, agility training, and activities that engage their herding instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to build stamina and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play to keep them physically and mentally stimulated.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and eye problems. Regular vet check-ups are essential."
        },
        
        {
            "name": "Border Terrier",
            "average_weight_kg": [
                5.9,
                7.2
            ],
            "average_height_cm": [
                25,
                36
            ],
            "dietary_recommendations": "Border Terriers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Border Terriers can be prone to certain health issues, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "Border Terriers require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        
        {
            "name": "Boston Terrier",
            "average_weight_kg": [
                4.5,
                11
            ],
            "average_height_cm": [
                30,
                38
            ],
            "dietary_recommendations": "Boston Terriers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Boston Terriers can be prone to certain health issues, including breathing problems and obesity, so monitoring their diet and exercise is crucial.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Boston Terriers require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of breathing issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Bouvier des Flandres",
            "average_weight_kg": [
                27,
                45
            ],
            "average_height_cm": [
                58,
                68
            ],
            "dietary_recommendations": "Bouvier des Flandres should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining muscle mass and supporting their active lifestyle. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium to avoid joint issues.",
                "adult": "Maintain a balanced diet high in protein and fat to support their energy needs.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Bouvier des Flandres may be prone to hip dysplasia, so maintaining a healthy weight and providing joint support is important.",
            "activity_level": "High",
            "exercise_recommendations": "Bouvier des Flandres require regular, vigorous exercise, including daily walks, runs, and engaging activities that stimulate their herding instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to build stamina and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any emerging health concerns."
        },
        
        {
            "name": "Boxer",
            "average_weight_kg": [
                25,
                32
            ],
            "average_height_cm": [
                53,
                63
            ],
            "dietary_recommendations": "Boxers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is crucial for maintaining muscle mass and supporting their active lifestyle. Portion control is essential to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium to avoid joint issues.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their high energy levels.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Boxers may be prone to certain health issues, including heart problems and hip dysplasia, so regular veterinary check-ups are important.",
            "activity_level": "High",
            "exercise_recommendations": "Boxers require regular, vigorous exercise, including daily runs, walks, and interactive play to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and agility training.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of heart issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Boykin Spaniel",
            "average_weight_kg": [
                11,
                18
            ],
            "average_height_cm": [
                33,
                41
            ],
            "dietary_recommendations": "Boykin Spaniels should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is important for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Boykin Spaniels can be prone to certain health issues, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "High",
            "exercise_recommendations": "Boykin Spaniels require regular exercise, including daily walks, play sessions, and activities that engage their retrieving instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including swimming and retrieving games.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Bracco Italiano",
            "average_weight_kg": [
                25,
                40
            ],
            "average_height_cm": [
                55,
                67
            ],
            "dietary_recommendations": "Bracco Italianos should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining energy levels and muscle mass. Portion control is important to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Bracco Italianos may be prone to certain health issues, including hip dysplasia, so regular veterinary care is important.",
            "activity_level": "High",
            "exercise_recommendations": "Bracco Italianos require regular, vigorous exercise, including daily runs, walks, and activities that stimulate their hunting instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any emerging health concerns."
        },
        
        {
            "name": "Briard",
            "average_weight_kg": [
                27,
                45
            ],
            "average_height_cm": [
                56,
                68
            ],
            "dietary_recommendations": "Briards should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and muscle mass.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium.",
                "adult": "Maintain a balanced diet high in protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Briards may be prone to certain health issues, including hip dysplasia, so maintaining a healthy weight and providing joint support is important.",
            "activity_level": "High",
            "exercise_recommendations": "Briards require regular, vigorous exercise, including daily runs, agility training, and activities that engage their herding instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to build stamina and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Brittany",
            "average_weight_kg": [
                12,
                18
            ],
            "average_height_cm": [
                43,
                51
            ],
            "dietary_recommendations": "Brittanys should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein is important for maintaining energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Brittanys may be prone to certain health issues, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "High",
            "exercise_recommendations": "Brittanys require regular, vigorous exercise, including daily runs, walks, and activities that engage their natural hunting instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running, hiking, and interactive play to keep them fit.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility without overexertion."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Bull Terrier",
            "average_weight_kg": [
                23,
                35
            ],
            "average_height_cm": [
                51,
                61
            ],
            "dietary_recommendations": "Bull Terriers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Bull Terriers may be prone to skin conditions and certain health issues, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "Bull Terriers require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate to vigorous exercise, including running and interactive play.",
                "senior": "Gentle walks and low-impact activities to maintain mobility without excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },

        {
            "name": "Bull Terrier (Miniature) ",
            "average_weight_kg": [
                11,
                16
            ],
            "average_height_cm": [
                25,
                35
            ],
            "dietary_recommendations": "Miniature Bull Terriers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Miniature Bull Terriers can be prone to certain health issues, including skin problems, so monitoring their diet is essential.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "Miniature Bull Terriers require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of skin issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Bullmastiff",
            "average_weight_kg": [
                50,
                59
            ],
            "average_height_cm": [
                61,
                69
            ],
            "dietary_recommendations": "Bullmastiffs should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein and fat is important for maintaining their energy levels and muscle mass. Portion control is crucial to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium to avoid joint issues.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Bullmastiffs are prone to certain health issues, including hip dysplasia and bloat, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Bullmastiffs require regular exercise, including daily walks and play sessions to keep them fit without overexerting them.",
            "age_related_exercise": {
                "puppy": "Short, controlled play sessions to avoid stressing developing joints.",
                "adult": "Regular moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and bloat. Regular vet check-ups are important to manage potential health concerns."
        },
        
        {
            "name": "Cairn Terrier",
            "average_weight_kg": [
                6,
                8
            ],
            "average_height_cm": [
                28,
                31
            ],
            "dietary_recommendations": "Cairn Terriers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Cairn Terriers can be prone to certain health issues, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Cairn Terriers require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Cane Corso",
            "average_weight_kg": [
                40,
                50
            ],
            "average_height_cm": [
                60,
                70
            ],
            "dietary_recommendations": "Cane Corsos should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein and fat is important for maintaining energy levels and muscle mass. Portion control is crucial to prevent obesity, which can strain their joints.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium to avoid joint issues.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Cane Corsos may be prone to certain health issues, including hip dysplasia, so maintaining a healthy weight and providing joint support is important.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "Cane Corsos require regular exercise, including daily walks, play sessions, and activities that engage their natural guarding instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to avoid stressing developing joints.",
                "adult": "Regular, vigorous exercise, including walking and interactive play.",
                "senior": "Gentle walks and low-impact activities to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any emerging health concerns."
        },
        
        {
            "name": "Cardigan Welsh Corgi",
            "average_weight_kg": [
                11,
                15
            ],
            "average_height_cm": [
                25,
                30
            ],
            "dietary_recommendations": "Cardigan Welsh Corgis should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity, as they are prone to weight gain.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Cardigan Welsh Corgis may be prone to certain health issues, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Cardigan Welsh Corgis require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Catahoula Leopard Dog",
            "average_weight_kg": [
                18,
                50
            ],
            "average_height_cm": [
                46,
                61
            ],
            "dietary_recommendations": "Catahoula Leopard Dogs should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein and fat is important for maintaining their energy levels and muscle mass.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet with sufficient protein to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Catahoula Leopard Dogs may be prone to certain health issues, including hip dysplasia, so maintaining a healthy weight and providing joint support is important.",
            "activity_level": "High",
            "exercise_recommendations": "Catahoula Leopard Dogs require regular, vigorous exercise, including daily runs, walks, and engaging activities that stimulate their herding instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any emerging health concerns."
        },
        
        {
            "name": "Caucasian Shepherd (Ovcharka)",
            "average_weight_kg": [
                36,
                75
            ],
            "average_height_cm": [
                62,
                75
            ],
            "dietary_recommendations": "Caucasian Shepherd Dogs should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein and fat is important for maintaining their energy levels and muscle mass. Portion control is essential to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Caucasian Shepherds may be prone to certain health issues, including hip dysplasia, so maintaining a healthy weight and providing joint support is important.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "Caucasian Shepherd Dogs require regular exercise, including daily walks and activities that engage their guarding instincts.",
            "age_related_exercise": {
                "puppy": "Short, controlled play sessions to avoid stressing developing joints.",
                "adult": "Daily moderate exercise, including walking and interactive play.",
                "senior": "Gentle walks and low-impact activities to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Cavalier King Charles Spaniel",
            "average_weight_kg": [
                5,
                8
            ],
            "average_height_cm": [
                30,
                33
            ],
            "dietary_recommendations": "Cavalier King Charles Spaniels should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Cavalier King Charles Spaniels may be prone to certain health issues, including heart problems, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Cavalier King Charles Spaniels require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of heart issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Chesapeake Bay Retriever",
            "average_weight_kg": [
                25,
                36
            ],
            "average_height_cm": [
                56,
                66
            ],
            "dietary_recommendations": "Chesapeake Bay Retrievers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein and fat is essential for maintaining energy levels and muscle mass, especially due to their active lifestyle.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development, with balanced nutrients.",
                "adult": "Maintain a balanced diet high in protein to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Chesapeake Bay Retrievers may be prone to certain health issues, including hip dysplasia, so regular veterinary care is important.",
            "activity_level": "High",
            "exercise_recommendations": "Chesapeake Bay Retrievers require regular, vigorous exercise, including daily runs, swimming, and retrieving activities.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to build stamina and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Chinese Crested",
            "average_weight_kg": [
                4.5,
                5.4
            ],
            "average_height_cm": [
                28,
                33
            ],
            "dietary_recommendations": "Chinese Cresteds should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy skin. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Chinese Cresteds may be prone to dental issues and skin conditions, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Chinese Cresteds require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of dental issues and skin conditions. Regular vet check-ups are important."
        },
        
        {
            "name": "Chinese Shar-Pei",
            "average_weight_kg": [
                18,
                29
            ],
            "average_height_cm": [
                46,
                51
            ],
            "dietary_recommendations": "Chinese Shar-Pei should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Chinese Shar-Pei may be prone to skin issues and certain health problems, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Chinese Shar-Pei require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of skin issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Chinook",
            "average_weight_kg": [
                27,
                45
            ],
            "average_height_cm": [
                51,
                61
            ],
            "dietary_recommendations": "Chinooks should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet with high protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Chinooks may be prone to certain health issues, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "High",
            "exercise_recommendations": "Chinooks require regular, vigorous exercise, including daily runs, walks, and engaging activities that stimulate their working instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to build stamina and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any emerging health concerns."
        },
        
        {
            "name": "Chow Chow",
            "average_weight_kg": [
                25,
                38
            ],
            "average_height_cm": [
                46,
                56
            ],
            "dietary_recommendations": "Chow Chows should be fed a high-quality dog food appropriate for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Chow Chows may be prone to certain health issues, including hip dysplasia and skin conditions, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Chow Chows require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and skin problems. Regular vet check-ups are important to manage potential health concerns."
        },
    
        {
            "name": "Clumber Spaniel",
            "average_weight_kg": [
                25,
                38
            ],
            "average_height_cm": [
                43,
                51
            ],
            "dietary_recommendations": "Clumber Spaniels should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is important for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Clumber Spaniels may be prone to certain health issues, including hip dysplasia and obesity, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Clumber Spaniels require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "ocker Spaniel",
            "average_weight_kg": [
                12,
                14
            ],
            "average_height_cm": [
                38,
                43
            ],
            "dietary_recommendations": "English Cocker Spaniels should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is important for maintaining their energy levels and healthy coat. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "English Cocker Spaniels may be prone to certain health issues, including ear infections and obesity, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "English Cocker Spaniels require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of ear issues and obesity. Regular vet check-ups are important to manage potential health concerns."
        },
        
        {
            "name": "American Cocker Spaniel",
            "average_weight_kg": [
                11,
                13
            ],
            "average_height_cm": [
                36,
                41
            ],
            "dietary_recommendations": "American Cocker Spaniels should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "American Cocker Spaniels may be prone to certain health issues, including ear infections and obesity, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "American Cocker Spaniels require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of ear issues and obesity. Regular vet check-ups are important to manage potential health concerns."
        },
        
        {
            "name": "Coton de Tulear",
            "average_weight_kg": [
                4,
                6
            ],
            "average_height_cm": [
                23,
                30
            ],
            "dietary_recommendations": "Coton de Tulears should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Coton de Tulears can be prone to dental issues and certain skin conditions, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Coton de Tulears require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of dental issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Dachshund",
            "average_weight_kg": [
                7,
                14
            ],
            "average_height_cm": [
                20,
                25
            ],
            "dietary_recommendations": "Dachshunds should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is important for maintaining their energy levels and healthy coat. Monitor portions to prevent obesity, as they are prone to weight gain.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Dachshunds may be prone to certain health issues, including obesity and spinal problems, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Dachshunds require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Dalmatian",
            "average_weight_kg": [
                23,
                25
            ],
            "average_height_cm": [
                48,
                61
            ],
            "dietary_recommendations": "Dalmatians should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and muscle mass. Monitor portions to prevent obesity, as they can be prone to weight gain.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with high protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Dalmatians may be prone to certain health issues, including urinary stones and deafness, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "High",
            "exercise_recommendations": "Dalmatians require regular, vigorous exercise, including daily runs, walks, and engaging activities that stimulate their natural instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of urinary issues and provide regular veterinary care to manage any health concerns."
        },
       
        {
            "name": "Doberman Pinscher",
            "average_weight_kg": [
                32,
                45
            ],
            "average_height_cm": [
                61,
                71
            ],
            "dietary_recommendations": "Doberman Pinschers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and muscle mass. Portion control is crucial to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Doberman Pinschers may be prone to certain health issues, including dilated cardiomyopathy, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Very High",
            "exercise_recommendations": "Doberman Pinschers require regular, vigorous exercise, including daily runs, agility training, and engaging activities that stimulate their intelligence.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to build stamina and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play to keep them fit.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of heart issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Dogo Argentino",
            "average_weight_kg": [
                36,
                45
            ],
            "average_height_cm": [
                60,
                68
            ],
            "dietary_recommendations": "Dogo Argentinos should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein and fat is important for maintaining their energy levels and muscle mass. Portion control is essential to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Dogo Argentinos may be prone to certain health issues, including hip dysplasia, so maintaining a healthy weight and providing joint support is important.",
            "activity_level": "High",
            "exercise_recommendations": "Dogo Argentinos require regular, vigorous exercise, including daily runs, walks, and engaging activities that stimulate their natural instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to build stamina and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Dutch Shepherd",
            "average_weight_kg": [
                25,
                32
            ],
            "average_height_cm": [
                55,
                65
            ],
            "dietary_recommendations": "Dutch Shepherds should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Dutch Shepherds may be prone to certain health issues, including hip dysplasia, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "High",
            "exercise_recommendations": "Dutch Shepherds require regular, vigorous exercise, including daily runs, walks, and engaging activities that stimulate their working instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to build stamina and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "English Setter",
            "average_weight_kg": [
                25,
                36
            ],
            "average_height_cm": [
                61,
                69
            ],
            "dietary_recommendations": "English Setters should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is important for maintaining energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with high protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "English Setters may be prone to certain health issues, including hip dysplasia and certain cancers, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "High",
            "exercise_recommendations": "English Setters require regular, vigorous exercise, including daily runs, walks, and engaging activities that stimulate their hunting instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },

        {
            "name": "English Shepherd",
            "average_weight_kg": [
                18,
                30
            ],
            "average_height_cm": [
                46,
                61
            ],
            "dietary_recommendations": "English Shepherds should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is important for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with high protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "English Shepherds may be prone to certain health issues, including hip dysplasia and eye problems, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "High",
            "exercise_recommendations": "English Shepherds require regular, vigorous exercise, including daily runs, walks, and engaging activities that stimulate their herding instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to build stamina and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "English Springer Spaniel",
            "average_weight_kg": [
                20,
                30
            ],
            "average_height_cm": [
                46,
                51
            ],
            "dietary_recommendations": "English Springer Spaniels should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is important for maintaining energy levels and healthy coats. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with high protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "English Springer Spaniels may be prone to certain health issues, including hip dysplasia and ear infections, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "High",
            "exercise_recommendations": "English Springer Spaniels require regular, vigorous exercise, including daily runs, walks, and engaging activities that stimulate their hunting instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of ear issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "English Toy Spaniel",
            "average_weight_kg": [
                2.7,
                6.4
            ],
            "average_height_cm": [
                25,
                30
            ],
            "dietary_recommendations": "English Toy Spaniels should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "English Toy Spaniels can be prone to certain health issues, including dental problems, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Low to Moderate",
            "exercise_recommendations": "English Toy Spaniels require regular but moderate exercise, including daily walks and play sessions to keep them fit.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of dental issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "English Toy Terrier",
            "average_weight_kg": [
                2.7,
                4.5
            ],
            "average_height_cm": [
                25,
                30
            ],
            "dietary_recommendations": "English Toy Terriers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "English Toy Terriers can be prone to certain health issues, including dental problems and patellar luxation, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "English Toy Terriers require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of dental issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Eurasier",
            "average_weight_kg": [
                18,
                32
            ],
            "average_height_cm": [
                48,
                60
            ],
            "dietary_recommendations": "Eurasiers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Eurasiers may be prone to certain health issues, including hip dysplasia, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "Eurasiers require regular exercise, including daily walks and engaging activities that stimulate their intelligence.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate to vigorous exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Field Spaniel",
            "average_weight_kg": [
                20,
                27
            ],
            "average_height_cm": [
                43,
                48
            ],
            "dietary_recommendations": "Field Spaniels should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Field Spaniels may be prone to certain health issues, including hip dysplasia, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "Field Spaniels require regular exercise, including daily walks and engaging activities that stimulate their natural hunting instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to build stamina and coordination.",
                "adult": "Daily moderate to vigorous exercise, including running and interactive play.",
                "senior": "Gentle walks and low-impact activities to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Finnish Lapphund",
            "average_weight_kg": [
                20,
                30
            ],
            "average_height_cm": [
                46,
                58
            ],
            "dietary_recommendations": "Finnish Lapphunds should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is important for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Finnish Lapphunds may be prone to certain health issues, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "Finnish Lapphunds require regular exercise, including daily walks, play sessions, and activities that engage their herding instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Finnish Spitz",
            "average_weight_kg": [
                13,
                16
            ],
            "average_height_cm": [
                38,
                51
            ],
            "dietary_recommendations": "Finnish Spitz should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Finnish Spitz may be prone to certain health issues, including hip dysplasia, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "High",
            "exercise_recommendations": "Finnish Spitz require regular, vigorous exercise, including daily runs, walks, and engaging activities that stimulate their hunting instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "French Bulldog",
            "average_weight_kg": [
                8,
                14
            ],
            "average_height_cm": [
                28,
                31
            ],
            "dietary_recommendations": "French Bulldogs should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is important for maintaining their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "French Bulldogs can be prone to breathing problems and other health issues, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Low to Moderate",
            "exercise_recommendations": "French Bulldogs require regular but moderate exercise, including daily walks and play sessions to keep them fit.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of breathing issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "German Pinscher",
            "average_weight_kg": [
                11,
                20
            ],
            "average_height_cm": [
                43,
                51
            ],
            "dietary_recommendations": "German Pinschers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "German Pinschers may be prone to certain health issues, including hip dysplasia and certain skin conditions, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "High",
            "exercise_recommendations": "German Pinschers require regular, vigorous exercise, including daily runs, walks, and engaging activities that stimulate their intelligence.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "German Shepherd Dog",
            "average_weight_kg": [
                22,
                40
            ],
            "average_height_cm": [
                55,
                65
            ],
            "dietary_recommendations": "German Shepherds should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is crucial for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "German Shepherds may be prone to certain health issues, including hip and elbow dysplasia, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "High",
            "exercise_recommendations": "German Shepherds require regular, vigorous exercise, including daily runs, walks, and engaging activities that stimulate their intelligence.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "German Shorthaired Pointer",
            "average_weight_kg": [
                20,
                32
            ],
            "average_height_cm": [
                56,
                64
            ],
            "dietary_recommendations": "German Shorthaired Pointers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with high protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "German Shorthaired Pointers may be prone to certain health issues, including hip dysplasia, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Very High",
            "exercise_recommendations": "German Shorthaired Pointers require regular, vigorous exercise, including daily runs, walks, and engaging activities that stimulate their hunting instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },

        {
            "name": "Giant Schnauzer",
            "average_weight_kg": [
                25,
                48
            ],
            "average_height_cm": [
                60,
                70
            ],
            "dietary_recommendations": "Giant Schnauzers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is crucial for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Giant Schnauzers may be prone to certain health issues, including hip dysplasia and certain cancers, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "High",
            "exercise_recommendations": "Giant Schnauzers require regular, vigorous exercise, including daily runs, walks, and engaging activities that stimulate their intelligence.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to build stamina and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Glen of Imaal Terrier",
            "average_weight_kg": [
                14,
                16
            ],
            "average_height_cm": [
                30,
                36
            ],
            "dietary_recommendations": "Glen of Imaal Terriers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Glen of Imaal Terriers can be prone to certain health issues, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Glen of Imaal Terriers require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Golden Retriever",
            "average_weight_kg": [
                25,
                34
            ],
            "average_height_cm": [
                51,
                61
            ],
            "dietary_recommendations": "Golden Retrievers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and healthy coat. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with high protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Golden Retrievers may be prone to certain health issues, including hip dysplasia and certain cancers, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "High",
            "exercise_recommendations": "Golden Retrievers require regular, vigorous exercise, including daily runs, walks, and engaging activities that stimulate their retrieving instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Gordon Setter",
            "average_weight_kg": [
                25,
                36
            ],
            "average_height_cm": [
                61,
                69
            ],
            "dietary_recommendations": "Gordon Setters should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is important for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with high protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Gordon Setters may be prone to certain health issues, including hip dysplasia, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "High",
            "exercise_recommendations": "Gordon Setters require regular, vigorous exercise, including daily runs, walks, and engaging activities that stimulate their hunting instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Great Dane",
            "average_weight_kg": [
                50,
                90
            ],
            "average_height_cm": [
                71,
                86
            ],
            "dietary_recommendations": "Great Danes should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity, which can strain their joints.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Great Danes may be prone to certain health issues, including bloat and hip dysplasia, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Great Danes require regular, moderate exercise, including daily walks and play sessions to keep them fit without overexertion.",
            "age_related_exercise": {
                "puppy": "Short, controlled play sessions to avoid stressing developing joints.",
                "adult": "Regular moderate exercise, including walking and interactive play.",
                "senior": "Gentle walks and low-impact activities to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of bloat and joint issues, and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Great Pyrenees",
            "average_weight_kg": [
                36,
                58
            ],
            "average_height_cm": [
                66,
                81
            ],
            "dietary_recommendations": "Great Pyrenees should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and healthy coat. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Great Pyrenees may be prone to certain health issues, including hip dysplasia and certain heart conditions, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Great Pyrenees require regular exercise, including daily walks and play sessions, but they are not as active as some other breeds.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to build stamina and coordination.",
                "adult": "Daily moderate exercise, including walks and gentle play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        

        {
            "name": "Greyhound",
            "average_weight_kg": [
                27,
                32
            ],
            "average_height_cm": [
                68,
                76
            ],
            "dietary_recommendations": "Greyhounds should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with high protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Greyhounds may be prone to certain health issues, including bloat and hip dysplasia, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "Greyhounds require regular exercise, including daily walks and opportunities to run in a safe environment.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate to vigorous exercise, including running and interactive play.",
                "senior": "Gentle walks and low-impact activities to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },

        {
            "name": "Griffon Bruxellois",
            "average_weight_kg": [
                3,
                6
            ],
            "average_height_cm": [
                25,
                28
            ],
            "dietary_recommendations": "Griffon Bruxellois should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Griffon Bruxellois may be prone to certain health issues, including dental problems, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Griffon Bruxellois require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of dental issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Harrier",
            "average_weight_kg": [
                18,
                27
            ],
            "average_height_cm": [
                48,
                58
            ],
            "dietary_recommendations": "Harriers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with high protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Harriers may be prone to certain health issues, including hip dysplasia and ear infections, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "High",
            "exercise_recommendations": "Harriers require regular, vigorous exercise, including daily runs, walks, and engaging activities that stimulate their hunting instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Havanese",
            "average_weight_kg": [
                4.5,
                6.8
            ],
            "average_height_cm": [
                23,
                30
            ],
            "dietary_recommendations": "Havanese should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Havanese may be prone to certain health issues, including dental problems and luxating patellas, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Havanese require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of dental issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Irish Setter",
            "average_weight_kg": [
                25,
                34
            ],
            "average_height_cm": [
                61,
                69
            ],
            "dietary_recommendations": "Irish Setters should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is important for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with high protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Irish Setters may be prone to certain health issues, including hip dysplasia and certain cancers, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "High",
            "exercise_recommendations": "Irish Setters require regular, vigorous exercise, including daily runs, walks, and engaging activities that stimulate their hunting instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Irish Terrier",
            "average_weight_kg": [
                11,
                13
            ],
            "average_height_cm": [
                46,
                56
            ],
            "dietary_recommendations": "Irish Terriers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is important for maintaining their energy levels and healthy coat. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Irish Terriers may be prone to certain health issues, including hip dysplasia and skin conditions, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "Irish Terriers require regular exercise, including daily walks, play sessions, and activities that engage their hunting instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of skin issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Irish Wolfhound",
            "average_weight_kg": [
                54,
                86
            ],
            "average_height_cm": [
                71,
                86
            ],
            "dietary_recommendations": "Irish Wolfhounds should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity, which can strain their joints.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Irish Wolfhounds may be prone to certain health issues, including bloat and hip dysplasia, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Irish Wolfhounds require regular, moderate exercise, including daily walks and play sessions to keep them fit without overexertion.",
            "age_related_exercise": {
                "puppy": "Short, controlled play sessions to avoid stressing developing joints.",
                "adult": "Regular moderate exercise, including walking and interactive play.",
                "senior": "Gentle walks and low-impact activities to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of bloat and joint issues, and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Italian Greyhound",
            "average_weight_kg": [
                3.6,
                5
            ],
            "average_height_cm": [
                32,
                38
            ],
            "dietary_recommendations": "Italian Greyhounds should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Italian Greyhounds may be prone to certain health issues, including dental problems and certain heart conditions, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Italian Greyhounds require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of dental issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Japanese Chin",
            "average_weight_kg": [
                1.8,
                4.5
            ],
            "average_height_cm": [
                23,
                28
            ],
            "dietary_recommendations": "Japanese Chins should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Japanese Chins may be prone to certain health issues, including dental problems and luxating patellas, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Low to Moderate",
            "exercise_recommendations": "Japanese Chins require regular but moderate exercise, including daily walks and play sessions to keep them fit.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of dental issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Japanese Spitz",
            "average_weight_kg": [
                5,
                10
            ],
            "average_height_cm": [
                30,
                38
            ],
            "dietary_recommendations": "Japanese Spitz should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Japanese Spitz may be prone to certain health issues, including dental problems and hip dysplasia, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Japanese Spitz require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of dental issues and provide regular veterinary care to manage any health concerns."
        },

        {
            "name": "Keeshond",
            "average_weight_kg": [
                16,
                27
            ],
            "average_height_cm": [
                43,
                55
            ],
            "dietary_recommendations": "Keeshonds should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Keeshonds may be prone to certain health issues, including hip dysplasia and heart problems, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Keeshonds require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Komondor",
            "average_weight_kg": [
                36,
                62
            ],
            "average_height_cm": [
                64,
                84
            ],
            "dietary_recommendations": "Komondors should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Komondors may be prone to certain health issues, including hip dysplasia and bloat, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Komondors require regular exercise, including daily walks and engaging activities to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Kooikerhondje",
            "average_weight_kg": [
                9,
                11
            ],
            "average_height_cm": [
                35,
                40
            ],
            "dietary_recommendations": "Kooikerhondjes should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Kooikerhondjes may be prone to certain health issues, including hip dysplasia and patellar luxation, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Kooikerhondjes require regular exercise, including daily walks and engaging activities to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Kuvasz",
            "average_weight_kg": [
                36,
                62
            ],
            "average_height_cm": [
                66,
                76
            ],
            "dietary_recommendations": "Kuvasz should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Kuvasz may be prone to certain health issues, including hip dysplasia and certain skin conditions, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Kuvasz require regular exercise, including daily walks and engaging activities to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Labrador Retriever",
            "average_weight_kg": [
                25,
                36
            ],
            "average_height_cm": [
                55,
                62
            ],
            "dietary_recommendations": "Labrador Retrievers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is important for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with high protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Labrador Retrievers may be prone to certain health issues, including hip dysplasia and obesity, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "High",
            "exercise_recommendations": "Labrador Retrievers require regular, vigorous exercise, including daily runs, walks, and engaging activities that stimulate their retrieving instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Lagotto Romagnolo",
            "average_weight_kg": [
                11,
                16
            ],
            "average_height_cm": [
                41,
                48
            ],
            "dietary_recommendations": "Lagotto Romagnolos should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and healthy coat. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Lagotto Romagnolos may be prone to certain health issues, including hip dysplasia and ear infections, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "Lagotto Romagnolos require regular exercise, including daily walks, play sessions, and engaging activities that stimulate their natural instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Lancashire Heeler",
            "average_weight_kg": [
                5,
                7
            ],
            "average_height_cm": [
                25,
                30
            ],
            "dietary_recommendations": "Lancashire Heelers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Lancashire Heelers may be prone to certain health issues, including dental problems, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "Lancashire Heelers require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "spec,ial_health_considerations": "Monitor for signs of dental issues and provide regular veterinary care to manage any health concerns."
        }
        ,
        {
            "name": "Leonberger",
            "average_weight_kg": [
                40,
                77
            ],
            "average_height_cm": [
                65,
                80
            ],
            "dietary_recommendations": "Leonbergers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Leonbergers may be prone to certain health issues, including hip dysplasia and certain heart conditions, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Leonbergers require regular exercise, including daily walks and play sessions, but they should not be overexerted due to their size.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to build stamina and coordination.",
                "adult": "Daily moderate exercise, including walks and gentle play.",
                "senior": "Gentle walks and low-impact activities to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Lhasa Apso",
            "average_weight_kg": [
                5,
                8
            ],
            "average_height_cm": [
                25,
                28
            ],
            "dietary_recommendations": "Lhasa Apsos should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Lhasa Apsos may be prone to certain health issues, including dental problems and luxating patellas, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Lhasa Apsos require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of dental issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Maltese",
            "average_weight_kg": [
                1.8,
                3.6
            ],
            "average_height_cm": [
                20,
                25
            ],
            "dietary_recommendations": "Maltese should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Maltese may be prone to certain health issues, including dental problems and patellar luxation, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Low to Moderate",
            "exercise_recommendations": "Maltese require regular but moderate exercise, including daily walks and play sessions to keep them fit.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of dental issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Miniature American Shepherd",
            "average_weight_kg": [
                9,
                18
            ],
            "average_height_cm": [
                33,
                46
            ],
            "dietary_recommendations": "Miniature American Shepherds should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with high protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Miniature American Shepherds may be prone to certain health issues, including hip dysplasia and certain eye conditions, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "High",
            "exercise_recommendations": "Miniature American Shepherds require regular, vigorous exercise, including daily runs, walks, and engaging activities that stimulate their herding instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Miniature Pinscher",
            "average_weight_kg": [
                4,
                5
            ],
            "average_height_cm": [
                25,
                30
            ],
            "dietary_recommendations": "Miniature Pinschers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Miniature Pinschers may be prone to certain health issues, including patellar luxation and certain skin conditions, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "High",
            "exercise_recommendations": "Miniature Pinschers require regular, vigorous exercise, including daily runs, walks, and engaging activities that stimulate their natural instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Miniature Schnauzer",
            "average_weight_kg": [
                5,
                9
            ],
            "average_height_cm": [
                30,
                36
            ],
            "dietary_recommendations": "Miniature Schnauzers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Miniature Schnauzers may be prone to certain health issues, including pancreatitis and certain skin conditions, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Miniature Schnauzers require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
      
        {
            "name": "Newfoundland",
            "average_weight_kg": [
                45,
                68
            ],
            "average_height_cm": [
                66,
                76
            ],
            "dietary_recommendations": "Newfoundlands should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Newfoundlands may be prone to certain health issues, including hip dysplasia and heart conditions, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Newfoundlands require regular exercise, including daily walks and gentle play sessions to keep them fit.",
            "age_related_exercise": {
                "puppy": "Short, controlled play sessions to avoid stressing developing joints.",
                "adult": "Daily moderate exercise, including walking and interactive play.",
                "senior": "Gentle walks and low-impact activities to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Norfolk Terrier",
            "average_weight_kg": [
                5,
                6.5
            ],
            "average_height_cm": [
                23,
                25
            ],
            "dietary_recommendations": "Norfolk Terriers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Norfolk Terriers may be prone to certain health issues, including dental problems and patellar luxation, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Norfolk Terriers require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of dental issues and provide regular veterinary care to manage any health concerns."
        },

        {
            "name": "Norwich Terrier",
            "average_weight_kg": [
                5,
                6.5
            ],
            "average_height_cm": [
                23,
                26
            ],
            "dietary_recommendations": "Norwich Terriers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Norwich Terriers may be prone to certain health issues, including dental problems and patellar luxation, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Norwich Terriers require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of dental issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Nova Scotia Duck Tolling Retriever",
            "average_weight_kg": [
                16,
                23
            ],
            "average_height_cm": [
                43,
                53
            ],
            "dietary_recommendations": "Nova Scotia Duck Tolling Retrievers should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with high protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Nova Scotia Duck Tolling Retrievers may be prone to certain health issues, including hip dysplasia and certain eye conditions, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "High",
            "exercise_recommendations": "Nova Scotia Duck Tolling Retrievers require regular, vigorous exercise, including daily runs, walks, and engaging activities that stimulate their retrieving instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Old English Sheepdog",
            "average_weight_kg": [
                27,
                45
            ],
            "average_height_cm": [
                61,
                66
            ],
            "dietary_recommendations": "Old English Sheepdogs should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Old English Sheepdogs may be prone to certain health issues, including hip dysplasia and certain eye conditions, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "Old English Sheepdogs require regular exercise, including daily walks, play sessions, and activities that engage their herding instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate to vigorous exercise, including running and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Olde English Bulldogge",
            "average_weight_kg": [
                27,
                45
            ],
            "average_height_cm": [
                38,
                50
            ],
            "dietary_recommendations": "Olde English Bulldogges should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Olde English Bulldogges may be prone to certain health issues, including hip dysplasia and breathing problems, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Olde English Bulldogges require regular, moderate exercise, including daily walks and play sessions to keep them fit.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Papillon",
            "average_weight_kg": [
                2.3,
                4.5
            ],
            "average_height_cm": [
                28,
                30
            ],
            "dietary_recommendations": "Papillons should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Papillons may be prone to dental issues, so regular dental care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Papillons require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of dental issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Pekingese",
            "average_weight_kg": [
                3.2,
                6.4
            ],
            "average_height_cm": [
                15,
                23
            ],
            "dietary_recommendations": "Pekingese should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Pekingese may be prone to certain health issues, including breathing problems and eye conditions, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Low to Moderate",
            "exercise_recommendations": "Pekingese require regular but moderate exercise, including daily walks and play sessions to keep them fit.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of breathing issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Pembroke Welsh Corgi",
            "average_weight_kg": [
                10,
                12
            ],
            "average_height_cm": [
                25,
                30
            ],
            "dietary_recommendations": "Pembroke Welsh Corgis should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with high protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Pembroke Welsh Corgis may be prone to certain health issues, including hip dysplasia and obesity, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "Pembroke Welsh Corgis require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate to vigorous exercise, including running and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Perro de Presa Canario",
            "average_weight_kg": [
                36,
                58
            ],
            "average_height_cm": [
                56,
                66
            ],
            "dietary_recommendations": "Perro de Presa Canarios should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Perro de Presa Canarios may be prone to certain health issues, including hip dysplasia and certain heart conditions, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "Perro de Presa Canarios require regular exercise, including daily walks and engaging activities to keep them fit.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate to vigorous exercise, including running and interactive play.",
                "senior": "Gentle walks and low-impact activities to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Pharaoh Hound",
            "average_weight_kg": [
                22,
                30
            ],
            "average_height_cm": [
                53,
                63
            ],
            "dietary_recommendations": "Pharaoh Hounds should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with high protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Pharaoh Hounds may be prone to certain health issues, including hip dysplasia and certain skin conditions, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "High",
            "exercise_recommendations": "Pharaoh Hounds require regular, vigorous exercise, including daily runs, walks, and engaging activities that stimulate their hunting instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Plott",
            "average_weight_kg": [
                18,
                36
            ],
            "average_height_cm": [
                51,
                69
            ],
            "dietary_recommendations": "Plotts should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and muscle mass. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula that supports healthy growth without excessive calcium.",
                "adult": "Maintain a balanced diet with sufficient protein and fat to support their active lifestyle.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Plotts may be prone to certain health issues, including hip dysplasia and certain skin conditions, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "High",
            "exercise_recommendations": "Plotts require regular, vigorous exercise, including daily runs, walks, and engaging activities that stimulate their hunting instincts.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Pomeranian",
            "average_weight_kg": [
                1.8,
                3.2
            ],
            "average_height_cm": [
                18,
                30
            ],
            "dietary_recommendations": "Pomeranians should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Pomeranians may be prone to certain health issues, including dental problems and luxating patellas, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Pomeranians require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of dental issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Poodle (Miniature)",
            "average_weight_kg": [
                7,
                10
            ],
            "average_height_cm": [
                28,
                38
            ],
            "dietary_recommendations": "Miniature Poodles should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Miniature Poodles may be prone to certain health issues, including hip dysplasia and certain eye conditions, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Miniature Poodles require regular exercise, including daily walks and engaging activities to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Poodle (Toy)",
            "average_weight_kg": [
                2.7,
                4.5
            ],
            "average_height_cm": [
                24,
                28
            ],
            "dietary_recommendations": "Toy Poodles should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Toy Poodles may be prone to certain health issues, including dental problems and luxating patellas, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Toy Poodles require regular exercise, including daily walks and play sessions to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of dental issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Pug",
            "average_weight_kg": [
                6.3,
                9.1
            ],
            "average_height_cm": [
                25,
                30
            ],
            "dietary_recommendations": "Pugs should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein helps maintain their energy levels and healthy coat. Monitor portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with moderate protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Pugs may be prone to certain health issues, including breathing problems and obesity, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "Low to Moderate",
            "exercise_recommendations": "Pugs require regular but moderate exercise, including daily walks and play sessions to keep them fit.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily moderate exercise, including walks and interactive play.",
                "senior": "Gentle walks and low-impact activities to keep them active while avoiding excessive strain."
            },
            "special_health_considerations": "Monitor for signs of breathing issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Puli",
            "average_weight_kg": [
                11,
                16
            ],
            "average_height_cm": [
                36,
                46
            ],
            "dietary_recommendations": "Pulis should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and healthy coat. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with high protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Pulis may be prone to certain health issues, including hip dysplasia and certain skin conditions, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "High",
            "exercise_recommendations": "Pulis require regular, vigorous exercise, including daily runs, walks, and engaging activities to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Pumi",
            "average_weight_kg": [
                9,
                15
            ],
            "average_height_cm": [
                36,
                47
            ],
            "dietary_recommendations": "Pumis should be fed a high-quality dog food suitable for their age (puppy, adult, or senior). A diet rich in protein is essential for maintaining their energy levels and healthy coat. Monitor portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide a puppy formula that supports healthy growth and development.",
                "adult": "Maintain a balanced diet that meets their energy needs, typically with high protein.",
                "senior": "Switch to a senior formula that helps manage weight and supports joint health."
            },
            "special_considerations": "Pumis may be prone to certain health issues, including hip dysplasia and certain skin conditions, so regular veterinary care and monitoring of their diet are essential.",
            "activity_level": "High",
            "exercise_recommendations": "Pumis require regular, vigorous exercise, including daily runs, walks, and engaging activities to keep them fit and mentally stimulated.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions to encourage socialization and coordination.",
                "adult": "Daily vigorous exercise, including running and interactive play.",
                "senior": "Moderate exercise, such as gentle walks, to maintain mobility."
            },
            "special_health_considerations": "Monitor for signs of joint issues and provide regular veterinary care to manage any health concerns."
        },
        
        {
            "name": "Rat Terrier",
            "average_weight_kg": [4.54, 11.34],
            "average_height_cm": [25.4, 45.72],
            "dietary_recommendations": "Provide a balanced diet with sufficient protein. Regular exercise is essential for their high energy levels.",
            "age_related_recommendations": {
                "puppy": "Feed high-quality puppy food for growth.",
                "adult": "Maintain a balanced diet for energy.",
                "senior": "Switch to senior dog food to support joint health."
            },
            "special_considerations": "May have a strong prey drive.",
            "activity_level": "High",
            "exercise_recommendations": "Daily exercise is necessary to manage their energy.",
            "age_related_exercise": {
                "puppy": "Play sessions for socialization.",
                "adult": "Regular vigorous activities.",
                "senior": "Gentle, consistent exercise."
            },
            "special_health_considerations": "Monitor for joint health as they age."
        },
        
        {
            "name": "Redbone Coonhound",
            "average_weight_kg": [20.41, 31.75],
            "average_height_cm": [53.34, 68.58],
            "dietary_recommendations": "Feed high-quality dog food appropriate for an active lifestyle.",
            "age_related_recommendations": {
                "puppy": "Provide a diet that supports growth.",
                "adult": "Maintain a balanced diet with enough protein.",
                "senior": "Switch to a senior formula for joint support."
            },
            "special_considerations": "Regular ear checks are needed.",
            "activity_level": "High",
            "exercise_recommendations": "Requires regular vigorous exercise, like walks and hunting activities.",
            "age_related_exercise": {
                "puppy": "Controlled play to build stamina.",
                "adult": "Daily intense exercise is beneficial.",
                "senior": "Moderate exercise to keep joints mobile."
            },
            "special_health_considerations": "Monitor weight to prevent obesity."
        },
        
        {
            "name": "Rhodesian Ridgeback",
            "average_weight_kg": [31.75, 38.56],
            "average_height_cm": [60.96, 68.58],
            "dietary_recommendations": "A balanced diet with appropriate protein levels supports their muscular build.",
            "age_related_recommendations": {
                "puppy": "Provide a large-breed puppy formula.",
                "adult": "Balanced diet to maintain muscle mass.",
                "senior": "Joint-supporting diet for older dogs."
            },
            "special_considerations": "Loyal and protective; exercise needed to avoid boredom.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "Requires daily activity, such as walks or play.",
            "age_related_exercise": {
                "puppy": "Avoid stressing joints.",
                "adult": "Regular running or hiking.",
                "senior": "Moderate, consistent exercise."
            },
            "special_health_considerations": "Monitor for hip dysplasia."
        },
        
        {
            "name": "Rottweiler",
            "average_weight_kg": [36.29, 61.23],
            "average_height_cm": [55.88, 68.58],
            "dietary_recommendations": "Protein-rich diet suitable for maintaining muscle mass.",
            "age_related_recommendations": {
                "puppy": "Large-breed puppy diet to prevent joint issues.",
                "adult": "Balanced diet with possible joint supplements.",
                "senior": "Senior formula to support joint health."
            },
            "special_considerations": "Strong and protective; structured training is beneficial.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Daily exercise is necessary to manage energy.",
            "age_related_exercise": {
                "puppy": "Avoid intense activities.",
                "adult": "Regular structured exercise.",
                "senior": "Gentle, low-impact activities."
            },
            "special_health_considerations": "Prone to hip and elbow dysplasia."
        },
        
        {
            "name": "Russian Toy",
            "average_weight_kg": [1.36, 2.72],
            "average_height_cm": [20.32, 27.94],
            "dietary_recommendations": "Provide a high-quality diet appropriate for their size.",
            "age_related_recommendations": {
                "puppy": "Nutrient-rich puppy food for growth.",
                "adult": "Maintain a balanced diet with portion control.",
                "senior": "Senior-specific diet to support overall health."
            },
            "special_considerations": "Dental health is a priority.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Daily walks and play sessions suffice.",
            "age_related_exercise": {
                "puppy": "Short, gentle play sessions.",
                "adult": "Moderate daily exercise.",
                "senior": "Gentle, low-impact activities."
            },
            "special_health_considerations": "Monitor dental and joint health."
        },
        
        {
            "name": "Saint Bernard",
            "average_weight_kg": [54.43, 81.65],
            "average_height_cm": [66.04, 76.2],
            "dietary_recommendations": "Feed a high-quality diet suitable for large breeds. Monitor portion sizes to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide large-breed puppy food to support slow, steady growth.",
                "adult": "Maintain a balanced diet to support muscle mass.",
                "senior": "Switch to a diet that supports joint health."
            },
            "special_considerations": "Prone to hip dysplasia due to their size.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Daily walks and playtime are necessary to stay healthy.",
            "age_related_exercise": {
                "puppy": "Avoid excessive running or jumping.",
                "adult": "Moderate exercise to prevent weight gain.",
                "senior": "Gentle walks to maintain mobility."
            },
            "special_health_considerations": "Monitor for joint issues and provide regular grooming for the thick coat."
        },
        
        {
            "name": "Saluki",
            "average_weight_kg": [18.14, 27.22],
            "average_height_cm": [58.42, 71.12],
            "dietary_recommendations": "Feed a balanced diet that supports an active lifestyle.",
            "age_related_recommendations": {
                "puppy": "Provide a diet rich in nutrients for growth.",
                "adult": "Maintain a high-quality diet for energy.",
                "senior": "Switch to a senior diet to support joint health."
            },
            "special_considerations": "Prone to bloat; feed smaller meals throughout the day.",
            "activity_level": "High",
            "exercise_recommendations": "Daily exercise, including running, is necessary.",
            "age_related_exercise": {
                "puppy": "Playtime should be controlled to avoid stress on developing bones.",
                "adult": "Frequent runs and walks.",
                "senior": "Low-impact activities to avoid joint strain."
            },
            "special_health_considerations": "Monitor for digestive issues and provide regular health checks."
        },
        
        {
            "name": "Samoyed",
            "average_weight_kg": [22.68, 30.84],
            "average_height_cm": [48.26, 60.96],
            "dietary_recommendations": "Provide a diet suitable for an active dog, with adequate protein.",
            "age_related_recommendations": {
                "puppy": "Feed nutrient-rich puppy food for growth.",
                "adult": "Balanced diet to maintain energy and coat health.",
                "senior": "Switch to senior food to support joint health."
            },
            "special_considerations": "Dense coat requires regular grooming to avoid matting.",
            "activity_level": "High",
            "exercise_recommendations": "Daily exercise, such as walks or playtime, is essential.",
            "age_related_exercise": {
                "puppy": "Short play sessions for development.",
                "adult": "Daily walks and vigorous activities.",
                "senior": "Moderate exercise to keep joints mobile."
            },
            "special_health_considerations": "Monitor for hip dysplasia and provide regular grooming."
        },
        
        {
            "name": "Schipperke",
            "average_weight_kg": [3.18, 9.07],
            "average_height_cm": [25.4, 33.02],
            "dietary_recommendations": "A balanced diet that supports an active lifestyle is recommended.",
            "age_related_recommendations": {
                "puppy": "High-quality puppy food for growth.",
                "adult": "Maintain a balanced diet with appropriate portion sizes.",
                "senior": "Senior dog food that supports overall health."
            },
            "special_considerations": "Regular grooming to manage shedding.",
            "activity_level": "High",
            "exercise_recommendations": "Daily walks and activities that stimulate their curiosity.",
            "age_related_exercise": {
                "puppy": "Playtime should include exploration.",
                "adult": "Vigorous daily exercise.",
                "senior": "Moderate, consistent exercise."
            },
            "special_health_considerations": "Monitor weight to prevent obesity and manage shedding regularly."
        },
        
        {
            "name": "Scottish Deerhound",
            "average_weight_kg": [34.02, 50.8],
            "average_height_cm": [71.12, 81.28],
            "dietary_recommendations": "Provide a balanced diet that meets the needs of a large, active breed.",
            "age_related_recommendations": {
                "puppy": "Feed a diet designed for large-breed puppies to support growth.",
                "adult": "Maintain a balanced diet for energy and muscle maintenance.",
                "senior": "Switch to senior dog food to support joint health."
            },
            "special_considerations": "Requires space for exercise due to sighthound nature.",
            "activity_level": "High",
            "exercise_recommendations": "Daily runs and spacious areas for exercise are necessary.",
            "age_related_exercise": {
                "puppy": "Avoid excessive running to protect joints.",
                "adult": "Daily exercise in open spaces.",
                "senior": "Gentle exercise to maintain mobility."
            },
            "special_health_considerations": "Monitor for joint issues and provide a proper exercise routine."
        },
        
        {
            "name": "Scottish Terrier",
            "average_weight_kg": [8.6, 10.4],
            "average_height_cm": [25, 28],
            "dietary_recommendations": "Feed a balanced diet suitable for small breeds, with appropriate portions to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "Provide nutrient-rich puppy food for growth.",
                "adult": "Maintain a balanced diet for weight management.",
                "senior": "Switch to a senior formula for joint support."
            },
            "special_considerations": "Prone to certain health issues like hip dysplasia.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Daily walks and playtime are ideal.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions for development.",
                "adult": "Regular moderate exercise.",
                "senior": "Gentle walks to maintain mobility."
            },
            "special_health_considerations": "Regular grooming for the wiry coat is necessary."
        },
        
        {
            "name": "Shetland Sheepdog",
            "average_weight_kg": [6.8, 11.3],
            "average_height_cm": [33, 41],
            "dietary_recommendations": "Provide a diet high in protein for active breeds, with portion control to maintain a healthy weight.",
            "age_related_recommendations": {
                "puppy": "Feed high-quality puppy food for growth.",
                "adult": "Maintain a balanced diet with protein.",
                "senior": "Switch to senior dog food to support joints."
            },
            "special_considerations": "Prone to eye problems and hip dysplasia.",
            "activity_level": "High",
            "exercise_recommendations": "Daily exercise, including running and training activities.",
            "age_related_exercise": {
                "puppy": "Short, engaging play sessions.",
                "adult": "Daily walks, agility, or herding activities.",
                "senior": "Moderate, regular exercise."
            },
            "special_health_considerations": "Regular grooming due to the dense double coat."
        },
        
        {
            "name": "Shiba Inu",
            "average_weight_kg": [8, 10.5],
            "average_height_cm": [34, 43],
            "dietary_recommendations": "Provide a balanced diet rich in protein, with portion control to prevent obesity.",
            "age_related_recommendations": {
                "puppy": "High-quality puppy food for healthy development.",
                "adult": "Maintain a balanced diet with sufficient protein.",
                "senior": "Switch to senior dog food for joint support."
            },
            "special_considerations": "Prone to allergies and joint issues.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "Daily walks and mental stimulation are needed.",
            "age_related_exercise": {
                "puppy": "Controlled play to encourage socialization.",
                "adult": "Regular exercise, such as walks and play.",
                "senior": "Gentle, consistent activities."
            },
            "special_health_considerations": "Regular coat grooming and monitoring for allergies."
        },
        
        {
            "name": "Shih Tzu",
            "average_weight_kg": [4, 7.3],
            "average_height_cm": [23, 27],
            "dietary_recommendations": "Feed a high-quality diet with appropriate portions to prevent weight gain.",
            "age_related_recommendations": {
                "puppy": "Provide nutrient-rich puppy food for growth.",
                "adult": "Balanced diet for weight control.",
                "senior": "Senior-specific diet to support joint health."
            },
            "special_considerations": "Regular grooming is needed due to their long coat.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Daily walks and indoor playtime.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions for development.",
                "adult": "Regular exercise like walks.",
                "senior": "Gentle walks to keep active."
            },
            "special_health_considerations": "Monitor for respiratory and eye issues."
        },
        
        {
            "name": "Shiloh Shepherd",
            "average_weight_kg": [45, 68],
            "average_height_cm": [66, 76],
            "dietary_recommendations": "Provide a diet suited for large breeds, with joint support supplements as needed.",
            "age_related_recommendations": {
                "puppy": "High-quality, large-breed puppy food.",
                "adult": "Balanced diet with joint support.",
                "senior": "Senior formula to support joints."
            },
            "special_considerations": "Prone to bloat; feed smaller, frequent meals.",
            "activity_level": "High",
            "exercise_recommendations": "Daily walks, playtime, and mental stimulation.",
            "age_related_exercise": {
                "puppy": "Avoid excessive running to protect joints.",
                "adult": "Regular exercise with space to roam.",
                "senior": "Moderate, low-impact activities."
            },
            "special_health_considerations": "Monitor for joint and digestive health issues."
        },
        
        {
            "name": "Siberian Husky",
            "average_weight_kg": [16, 27],
            "average_height_cm": [51, 60],
            "dietary_recommendations": "A diet high in protein supports their active lifestyle. Portion control is important.",
            "age_related_recommendations": {
                "puppy": "Provide high-quality puppy food for growth.",
                "adult": "Maintain a balanced diet for energy.",
                "senior": "Switch to senior dog food for joint health."
            },
            "special_considerations": "Regular grooming is needed due to heavy shedding.",
            "activity_level": "Very High",
            "exercise_recommendations": "Daily vigorous exercise, such as running.",
            "age_related_exercise": {
                "puppy": "Short, controlled activities.",
                "adult": "Regular intense exercise, including running.",
                "senior": "Moderate activities to maintain mobility."
            },
            "special_health_considerations": "Monitor for hip dysplasia and eye conditions."
        },
        
        {
            "name": "Smooth Fox Terrier",
            "average_weight_kg": [6.8, 8.6],
            "average_height_cm": [36, 39],
            "dietary_recommendations": "Provide a balanced diet suitable for active breeds. Monitor portions to avoid weight gain.",
            "age_related_recommendations": {
                "puppy": "High-quality puppy food for growth.",
                "adult": "Maintain a diet rich in protein to support activity levels.",
                "senior": "Switch to senior-specific food for joint health."
            },
            "special_considerations": "Consistent training is needed due to a strong prey drive.",
            "activity_level": "High",
            "exercise_recommendations": "Daily vigorous exercise, such as walks and play.",
            "age_related_exercise": {
                "puppy": "Short, controlled play sessions.",
                "adult": "Regular outdoor activities to burn energy.",
                "senior": "Gentle, consistent exercise."
            },
            "special_health_considerations": "Regular health check-ups to monitor for potential joint issues."
        },
        
        {
            "name": "Soft Coated Wheaten Terrier",
            "average_weight_kg": [13.6, 18.1],
            "average_height_cm": [41, 48],
            "dietary_recommendations": "Provide a high-quality diet to support an active lifestyle. Regular portion control is important.",
            "age_related_recommendations": {
                "puppy": "Feed a nutrient-rich puppy formula for growth.",
                "adult": "Balanced diet to maintain weight and coat health.",
                "senior": "Switch to a senior diet with joint support."
            },
            "special_considerations": "Regular grooming is essential for the coat.",
            "activity_level": "Moderate to High",
            "exercise_recommendations": "Daily exercise, such as walks and play.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions.",
                "adult": "Regular outdoor activities.",
                "senior": "Moderate, low-impact activities."
            },
            "special_health_considerations": "Monitor for potential allergies and skin issues."
        },
        
        {
            "name": "Spanish Water Dog",
            "average_weight_kg": [14, 22.7],
            "average_height_cm": [40, 51],
            "dietary_recommendations": "Provide a balanced diet with adequate protein for an active breed.",
            "age_related_recommendations": {
                "puppy": "Nutrient-rich puppy food to support growth.",
                "adult": "Maintain a diet suitable for an active lifestyle.",
                "senior": "Senior-specific diet to support joint health."
            },
            "special_considerations": "Minimal grooming needed; coat can be left natural.",
            "activity_level": "High",
            "exercise_recommendations": "Regular exercise, such as herding or retrieving.",
            "age_related_exercise": {
                "puppy": "Short, controlled play.",
                "adult": "Daily outdoor activities.",
                "senior": "Gentle, consistent exercise."
            },
            "special_health_considerations": "Monitor for joint issues and provide regular mental stimulation."
        },
        
        {
            "name": "Spinone Italiano",
            "average_weight_kg": [29, 39],
            "average_height_cm": [56, 70],
            "dietary_recommendations": "Provide a high-quality diet suitable for medium to large breeds.",
            "age_related_recommendations": {
                "puppy": "Puppy food to support steady growth.",
                "adult": "Balanced diet to maintain weight.",
                "senior": "Switch to senior formula for joint health."
            },
            "special_considerations": "Regular grooming is needed for the wiry coat.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Daily exercise, including long walks and outdoor activities.",
            "age_related_exercise": {
                "puppy": "Controlled play to avoid stress on joints.",
                "adult": "Regular exercise, such as walking or hiking.",
                "senior": "Moderate, gentle activities."
            },
            "special_health_considerations": "Monitor for hip dysplasia and other joint issues."
        },
        
        {
            "name": "Staffordshire Bull Terrier",
            "average_weight_kg": [11, 17],
            "average_height_cm": [36, 41],
            "dietary_recommendations": "Feed a high-protein diet to support muscle mass.",
            "age_related_recommendations": {
                "puppy": "Puppy formula for muscle and bone development.",
                "adult": "Balanced diet to maintain weight and muscle.",
                "senior": "Switch to senior food for joint support."
            },
            "special_considerations": "Consistent training is beneficial.",
            "activity_level": "High",
            "exercise_recommendations": "Daily vigorous activities like walking and playtime.",
            "age_related_exercise": {
                "puppy": "Short play sessions.",
                "adult": "Regular outdoor activities.",
                "senior": "Low-impact exercises."
            },
            "special_health_considerations": "Monitor for potential joint issues."
        },
        
        {
            "name": "Standard Schnauzer",
            "average_weight_kg": [14, 22],
            "average_height_cm": [44, 50],
            "dietary_recommendations": "A balanced diet rich in protein and suitable for active breeds is recommended.",
            "age_related_recommendations": {
                "puppy": "Feed a puppy diet for growth.",
                "adult": "Maintain a balanced diet with joint supplements.",
                "senior": "Switch to a senior formula for joint support."
            },
            "special_considerations": "Regular grooming needed for the wiry coat.",
            "activity_level": "High",
            "exercise_recommendations": "Daily activities such as walking and agility exercises.",
            "age_related_exercise": {
                "puppy": "Short play to build stamina.",
                "adult": "Regular vigorous exercise.",
                "senior": "Moderate, consistent activities."
            },
            "special_health_considerations": "Monitor for joint issues and provide regular grooming."
        },
        
        {
            "name": "Swedish Vallhund",
            "average_weight_kg": [9, 14],
            "average_height_cm": [30, 33],
            "dietary_recommendations": "Provide a high-quality diet suitable for an active herding breed.",
            "age_related_recommendations": {
                "puppy": "Puppy formula to support growth.",
                "adult": "Balanced diet to maintain energy.",
                "senior": "Switch to senior food for joint health."
            },
            "special_considerations": "Regular grooming is needed for the double coat.",
            "activity_level": "High",
            "exercise_recommendations": "Daily exercise, including herding and play.",
            "age_related_exercise": {
                "puppy": "Controlled play to protect developing joints.",
                "adult": "Regular, vigorous activities.",
                "senior": "Gentle, low-impact exercise."
            },
            "special_health_considerations": "Monitor for potential joint problems."
        },
        
        {
            "name": "Thai Ridgeback",
            "average_weight_kg": [15, 34],
            "average_height_cm": [51, 61],
            "dietary_recommendations": "Provide a balanced diet to support an active lifestyle. Portion control is important.",
            "age_related_recommendations": {
                "puppy": "High-quality puppy food for growth.",
                "adult": "Maintain a balanced diet rich in protein.",
                "senior": "Switch to senior-specific food for joint support."
            },
            "special_considerations": "Regular training and socialization are important.",
            "activity_level": "High",
            "exercise_recommendations": "Daily vigorous exercise is needed.",
            "age_related_exercise": {
                "puppy": "Play sessions for socialization.",
                "adult": "Daily runs and outdoor activities.",
                "senior": "Moderate, low-impact exercise."
            },
            "special_health_considerations": "Monitor for hip dysplasia."
        },
        
        {
            "name": "Tibetan Mastiff",
            "average_weight_kg": [34, 73],
            "average_height_cm": [61, 76],
            "dietary_recommendations": "High-quality diet for large breeds. Avoid overfeeding to prevent weight gain.",
            "age_related_recommendations": {
                "puppy": "Feed large-breed puppy food to support growth.",
                "adult": "Balanced diet for muscle maintenance.",
                "senior": "Senior formula for joint health."
            },
            "special_considerations": "Independent nature requires consistent training.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Daily exercise, including walks.",
            "age_related_exercise": {
                "puppy": "Avoid strenuous activities.",
                "adult": "Regular moderate exercise.",
                "senior": "Gentle activities to maintain mobility."
            },
            "special_health_considerations": "Regular grooming for shedding coat."
        },
        
        {
            "name": "Tibetan Spaniel",
            "average_weight_kg": [4, 7],
            "average_height_cm": [25, 27],
            "dietary_recommendations": "Provide a diet suited for small breeds, with portion control to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Nutrient-rich puppy food for growth.",
                "adult": "Balanced diet to maintain weight.",
                "senior": "Senior-specific food to support health."
            },
            "special_considerations": "Regular grooming is needed for their coat.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Daily walks and play sessions.",
            "age_related_exercise": {
                "puppy": "Gentle play for socialization.",
                "adult": "Regular exercise to stay active.",
                "senior": "Low-impact activities."
            },
            "special_health_considerations": "Monitor dental health."
        },
        
        {
            "name": "Tibetan Terrier",
            "average_weight_kg": [8, 14],
            "average_height_cm": [36, 43],
            "dietary_recommendations": "Balanced diet to support an active lifestyle.",
            "age_related_recommendations": {
                "puppy": "High-quality puppy food for development.",
                "adult": "Maintain a balanced diet.",
                "senior": "Senior formula to support joints."
            },
            "special_considerations": "Regular grooming is necessary due to long coat.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Daily exercise to stay fit.",
            "age_related_exercise": {
                "puppy": "Short play sessions.",
                "adult": "Regular activities, such as walks.",
                "senior": "Gentle exercise to maintain health."
            },
            "special_health_considerations": "Monitor for hip dysplasia."
        },
        
        {
            "name": "Toy Fox Terrier",
            "average_weight_kg": [1.5, 4],
            "average_height_cm": [21, 29],
            "dietary_recommendations": "Provide a high-quality diet suited for small, active breeds.",
            "age_related_recommendations": {
                "puppy": "Puppy-specific food for growth.",
                "adult": "Balanced diet to support activity.",
                "senior": "Senior-specific diet for health maintenance."
            },
            "special_considerations": "Socialization and training are beneficial.",
            "activity_level": "High",
            "exercise_recommendations": "Daily exercise and play.",
            "age_related_exercise": {
                "puppy": "Short, fun play sessions.",
                "adult": "Regular outdoor activities.",
                "senior": "Low-impact exercises."
            },
            "special_health_considerations": "Monitor dental health."
        },
        
        {
            "name": "Treeing Walker Coonhound",
            "average_weight_kg": [23, 32],
            "average_height_cm": [51, 69],
            "dietary_recommendations": "Provide a diet rich in protein for active hunting dogs.",
            "age_related_recommendations": {
                "puppy": "Puppy formula with balanced nutrients.",
                "adult": "Maintain a high-quality diet for energy.",
                "senior": "Switch to senior food for joint support."
            },
            "special_considerations": "Needs space for exercise.",
            "activity_level": "Very High",
            "exercise_recommendations": "Daily vigorous exercise is essential.",
            "age_related_exercise": {
                "puppy": "Controlled play to build stamina.",
                "adult": "Regular outdoor activities like running.",
                "senior": "Gentle exercises to keep fit."
            },
            "special_health_considerations": "Monitor for ear infections."
        },
        
        {
            "name": "Vizsla",
            "average_weight_kg": [20, 30],
            "average_height_cm": [53, 64],
            "dietary_recommendations": "Provide a balanced diet rich in protein to support their active lifestyle.",
            "age_related_recommendations": {
                "puppy": "Feed high-quality puppy food to support growth.",
                "adult": "Maintain a balanced diet to sustain energy levels.",
                "senior": "Switch to senior-specific food for joint support."
            },
            "special_considerations": "Regular exercise is necessary to manage their high energy levels.",
            "activity_level": "Very High",
            "exercise_recommendations": "Daily vigorous exercise, including running and outdoor activities.",
            "age_related_exercise": {
                "puppy": "Play sessions to encourage socialization.",
                "adult": "Daily exercise such as running and hiking.",
                "senior": "Gentle, consistent activities to maintain mobility."
            },
            "special_health_considerations": "Monitor for hip dysplasia and regular health check-ups."
        },
        
        {
            "name": "Weimaraner",
            "average_weight_kg": [25, 40],
            "average_height_cm": [58, 69],
            "dietary_recommendations": "High-quality diet with sufficient protein to support their active lifestyle.",
            "age_related_recommendations": {
                "puppy": "Puppy-specific formula for growth.",
                "adult": "Balanced diet to maintain energy levels.",
                "senior": "Switch to senior dog food for joint support."
            },
            "special_considerations": "Requires plenty of exercise and mental stimulation.",
            "activity_level": "Very High",
            "exercise_recommendations": "Daily vigorous exercise, such as running.",
            "age_related_exercise": {
                "puppy": "Controlled play sessions.",
                "adult": "Regular outdoor activities.",
                "senior": "Moderate, low-impact exercise."
            },
            "special_health_considerations": "Monitor for hip dysplasia."
        },
        
        {
            "name": "Welsh Springer Spaniel",
            "average_weight_kg": [16, 25],
            "average_height_cm": [43, 48],
            "dietary_recommendations": "Provide a balanced diet for an active dog.",
            "age_related_recommendations": {
                "puppy": "High-quality puppy food for growth.",
                "adult": "Balanced diet for weight maintenance.",
                "senior": "Switch to senior formula to support joint health."
            },
            "special_considerations": "Regular grooming needed for coat maintenance.",
            "activity_level": "High",
            "exercise_recommendations": "Daily outdoor activities.",
            "age_related_exercise": {
                "puppy": "Play sessions to encourage socialization.",
                "adult": "Regular exercise such as walking and running.",
                "senior": "Gentle activities to maintain mobility."
            },
            "special_health_considerations": "Monitor for ear infections."
        },
        
        {
            "name": "West Highland White Terrier",
            "average_weight_kg": [6, 10],
            "average_height_cm": [25, 28],
            "dietary_recommendations": "High-quality diet to maintain weight and energy.",
            "age_related_recommendations": {
                "puppy": "Puppy-specific food for healthy development.",
                "adult": "Balanced diet to support an active lifestyle.",
                "senior": "Switch to senior food for joint support."
            },
            "special_considerations": "Routine grooming is essential for the double coat.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Daily walks and playtime.",
            "age_related_exercise": {
                "puppy": "Short, playful sessions.",
                "adult": "Regular outdoor activities.",
                "senior": "Low-impact exercise."
            },
            "special_health_considerations": "Monitor for skin issues."
        },
        
        {
            "name": "Whippet",
            "average_weight_kg": [11, 21],
            "average_height_cm": [46, 56],
            "dietary_recommendations": "Provide a balanced diet suitable for a high-energy breed.",
            "age_related_recommendations": {
                "puppy": "High-quality puppy food for growth.",
                "adult": "Maintain a diet with sufficient protein.",
                "senior": "Senior-specific food to support joint health."
            },
            "special_considerations": "Requires regular exercise to manage energy levels.",
            "activity_level": "High",
            "exercise_recommendations": "Daily running and play.",
            "age_related_exercise": {
                "puppy": "Short, controlled play sessions.",
                "adult": "Regular exercise, such as sprints.",
                "senior": "Gentle, consistent activities."
            },
            "special_health_considerations": "Monitor for heart issues."
        },
        
        {
            "name": "Wire Fox Terrier",
            "average_weight_kg": [7, 9],
            "average_height_cm": [36, 39],
            "dietary_recommendations": "Balanced diet with appropriate portions to avoid obesity.",
            "age_related_recommendations": {
                "puppy": "Provide puppy food for growth.",
                "adult": "Maintain a diet to support activity levels.",
                "senior": "Switch to senior food for joint health."
            },
            "special_considerations": "Regular grooming is necessary for the wiry coat.",
            "activity_level": "High",
            "exercise_recommendations": "Daily vigorous exercise.",
            "age_related_exercise": {
                "puppy": "Play sessions for development.",
                "adult": "Regular outdoor activities.",
                "senior": "Moderate exercise."
            },
            "special_health_considerations": "Monitor for skin issues."
        },
        
        {
            "name": "Wirehaired Pointing Griffon",
            "average_weight_kg": [20, 36],
            "average_height_cm": [50, 60],
            "dietary_recommendations": "Provide a diet that supports an active lifestyle.",
            "age_related_recommendations": {
                "puppy": "High-quality puppy food for development.",
                "adult": "Balanced diet for energy maintenance.",
                "senior": "Senior-specific diet to support joints."
            },
            "special_considerations": "Regular grooming is needed to maintain coat texture.",
            "activity_level": "High",
            "exercise_recommendations": "Daily outdoor activities like running or hunting.",
            "age_related_exercise": {
                "puppy": "Controlled play sessions.",
                "adult": "Regular vigorous exercise.",
                "senior": "Gentle, consistent activities."
            },
            "special_health_considerations": "Monitor for hip dysplasia."
        },
        
        {
            "name": "Wirehaired Vizsla",
            "average_weight_kg": [20, 30],
            "average_height_cm": [55, 65],
            "dietary_recommendations": "Provide a balanced diet with adequate protein.",
            "age_related_recommendations": {
                "puppy": "Puppy-specific food for growth.",
                "adult": "Maintain a balanced diet for muscle development.",
                "senior": "Switch to senior-specific food for joint support."
            },
            "special_considerations": "Regular exercise is needed to manage energy levels.",
            "activity_level": "High",
            "exercise_recommendations": "Daily exercise, including running or outdoor activities.",
            "age_related_exercise": {
                "puppy": "Play sessions to encourage activity.",
                "adult": "Regular vigorous exercise.",
                "senior": "Gentle activities to maintain mobility."
            },
            "special_health_considerations": "Monitor for hip dysplasia."
        },
        
        {
            "name": "Xoloitzcuintli",
            "average_weight_kg": [4, 25],
            "average_height_cm": [25, 58],
            "dietary_recommendations": "Provide a balanced diet suitable for small to medium-sized breeds, depending on the dog's size.",
            "age_related_recommendations": {
                "puppy": "Puppy food for healthy growth.",
                "adult": "Maintain a balanced diet for muscle development.",
                "senior": "Switch to senior formula for joint support."
            },
            "special_considerations": "Skin care is essential for hairless varieties.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Regular exercise such as walks and playtime.",
            "age_related_exercise": {
                "puppy": "Controlled play sessions.",
                "adult": "Regular outdoor activities.",
                "senior": "Gentle exercise."
            },
            "special_health_considerations": "Monitor skin health for hairless types."
        },
        
        {
            "name": "Yorkshire Terrier",
            "average_weight_kg": [2, 3],
            "average_height_cm": [15, 23],
            "dietary_recommendations": "High-quality diet suitable for small breeds.",
            "age_related_recommendations": {
                "puppy": "Puppy-specific food for growth.",
                "adult": "Balanced diet to maintain weight.",
                "senior": "Senior-specific diet to support joint health."
            },
            "special_considerations": "Regular grooming is necessary for their long coat.",
            "activity_level": "Moderate",
            "exercise_recommendations": "Daily exercise, such as walks and playtime.",
            "age_related_exercise": {
                "puppy": "Short play sessions.",
                "adult": "Regular outdoor activities.",
                "senior": "Low-impact exercises."
            },
            "special_health_considerations": "Monitor dental health regularly."
        }
    ]
}